[
  {
    "Project ID": 1196,
    "Title": "Cosite Interference Prediction and Mitigation Tool",
    "Topic/tracking number": "N121-037",
    "T-Code": "4.5T",
    "TPOC": "Allen, Oliver",
    "TPOC Email": "oliver.allen@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Schneider, Marc",
    "Secondary TPOC Email": "marc.schneider@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "PMA263",
    "Interested PMA(s)": "",
    "Objective": "Develop an automated simulation tool that will predict and mitigate intrasystem (cosite) interference while integrating with existing databases of radio frequency (RF) component and equipment characteristics.",
    "Description": "Successful missions require compatibility between the numerous RF systems operating on a platform. The ability to predict and mitigate intrasystem, or cosite, interference before it becomes a problem is currently limited by the lack of suitable performance data for all of the systems on the platform (which is necessary to predict interference accurately). An integrated solution to model creation and simulation is needed in order to streamline the process of cosite interference prediction and mitigation. This in turn will improve the probability of successful fielding and deployment of new and upgraded aircraft.     Simulation tools exist today that predict cosite interference in complex RF environments such as those encountered on aircraft, ships, ground vehicles, and fixed installations. Sophisticated analysis engines have been implemented in these tools to enable them to predict many types of important electromagnetic interference (EMI) effects, including nonlinear phenomenon such as intermodulation products that can lead to interference when multiple RF systems operate simultaneously, even at different frequencies. The use of these simulation tools during initial system design and integration, as well as during upgrades and modifications to a platform, allows the electromagnetic environmental effects (E3) engineer to predict potential interference issues prior to installation and to put appropriate mitigation strategies in place. Further, the simulation models created for the analysis form a valuable baseline for evaluating future modifications and tracking changes over the course of the platform's life cycle.     The ability of these simulation tools to predict important interference effects is well established, but their successful application relies on the availability of appropriate models and databases for all of the RF equipment used on the platform. This includes all transmitters and receivers as well as other components such as cables, filters, amplifiers, diplexers, isolators, and so on. These models are based on the broadband performance characteristics of each subsystem, and the data needed to create the models can be difficult to obtain and assimilate into the simulation tool, often requiring a high level of expertise and investment of time on the part of the analyst. This creates a roadblock to realizing the significant benefit of these tools in identifying and mitigating interference problems early in the system design and integration phase, where their impact on ensuring interference-free deployment and mission success is at a maximum.     In order to leverage these simulation tools to their full potential, they must be capable of working with existing databases of equipment characteristics by extracting the necessary data and creating the required simulation models in an automated fashion. The models created should then be saved in a model library that is accessible within the simulation tool for re-use across multiple projects. The Joint Spectrum Center (JSC) maintains and continually updates a comprehensive database of equipment characteristics that contains \"detailed technical information about communications, radar, and electronic warfare equipment.\" The information contained in the JSC Equipment, Tactical and Space (JETS) database contains, among other things, the data needed to create the simulation models necessary for cosite interference prediction. However, manual extraction of the parameters required for cosite models is time consuming and error prone due to the voluminous nature of the data available for each subsystem and the particular nomenclature employed in JETS.     The integration of simulation tools with the JETS database requires the automated extraction and filtering of the necessary subsystem performance parameters at both the equipment and platform levels. The data so obtained should be used within the tool to create a library of models for use in cosite predictions. The simulation tool itself should incorporate the model library and allow the sharing of libraries between users and organizations. It is also desirable to develop new RF component models as needed and improve existing ones for which data are available in JETS but no models exist, or for which existing data are incompatible with current models. The model library should be updatable as new information is added to the JETS database by the JSC. This will lead to comprehensive, reusable, and extensible libraries that can be used for maintaining a cosite compatibiity model of a platform over its entire life cycle. Science and technology advances are needed in the area of automated data mining. Automating methods to accurately extract information from multiple different large data sets is required. A tool is needed that combines advanced computer science, artificial intelligence, and database management approaches.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "04-18-2012",
    "End date": "09-30-2015",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Radar and Antenna Systems Capability",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$0",
    "Actual total funding": "$1,229,686",
    "Last Updated": "10-01-2015"
  },
  {
    "Project ID": 1723,
    "Title": "Machine Learning and Air Combat",
    "Topic/tracking number": "219WFD-SG-13-011",
    "T-Code": "4.0M",
    "TPOC": "Darrow, Josh",
    "TPOC Email": "joshua.darrow@navy.mil",
    "TPOC code": "4.10.2.2",
    "Secondary TPOC": "Booz, Don",
    "Secondary TPOC Email": "donald.booz@navy.mil",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop and implement artificial intelligence techniques into the BRAWLER decision making model machine learning (ML) will enable the exploration of more tactical tradespace, as well as provide insight into future unmanned systems.",
    "Description": "Study from ML and artificial intelligence (AI) books, papers, and online courses\nCollaborate with experts in the field to learn industry best practices and to accelerate our learning\nEvaluate ML/AI techniques in toy problems (e.g. 2D WVR)\nApply ML/AI techniques to two analysis problems:\nOptimize rule set parameters \nFinding behavior that is different in order\nDevelop BRAWLER tactical battle manager\nFinding behavior that is different in kind",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.10",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2012",
    "End date": "09-30-2015",
    "Project status": "Transitioned",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Theater Air and Missile Defense (TAMD)",
    "STO": "STO-1:  Anti-Air Warfare (AAW) Performance",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$0",
    "Actual total funding": "$201,241",
    "Last Updated": "12-29-2015"
  },
  {
    "Project ID": 4461,
    "Title": "Masters in Computer Science",
    "Topic/tracking number": "219WFD-HE-18-042",
    "T-Code": "4.0M",
    "TPOC": "Ortiz, Arturo",
    "TPOC Email": "arturo.ortiz@navy.mil",
    "TPOC code": "4.0M.1.6",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Master of Science degree in Computer Science will increase modeling and data analytics capabilities provided by the 4.0M department. The degree comes with the specialization of Interactive Intelligence offering a strong grounding in artificial intelligence, and Human Computer Interactions, Machine Learning, Educational Technology.",
    "Description": "The skills obtained in the MS program will be applied to this work to provide more rigorous and meaningful data analysis and decision support. Through the use of the automated systems and artificial intelligence learned from the MS, the branch will be able to provide interactive models, classify sets of data, and forecast using tools and techniques that are currently being utilized in industry.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-20-2018",
    "End date": "06-01-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-4: Computing, Processing, and Architectures",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Non-Combat Operations (NCO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$6,500",
    "Actual total funding": "$5,430",
    "Last Updated": "10-30-2018"
  },
  {
    "Project ID": 4510,
    "Title": "Masters in Computer Science",
    "Topic/tracking number": "219WFD-HE-18-044",
    "T-Code": "4.0M",
    "TPOC": "Johnson, Mark Anthony",
    "TPOC Email": "markanthony.johnson@navy.mil",
    "TPOC code": "4.0M.1.6",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "Master of Science degree in Computer Science will increase modeling and data analytics capabilities provided by the 4.0M department. The degree comes with the specialization of machine learning  offering a strong grounding in machine learning techniques, artificial intelligence, and high-performance computing.",
    "Description": "",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-20-2018",
    "End date": "08-10-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-4: Computing, Processing, and Architectures",
    "I&I": "Non-Combat Operations (NCO)",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$6,600",
    "Actual total funding": "$6,600",
    "Last Updated": "06-11-2018"
  },
  {
    "Project ID": 2019,
    "Title": "Autonomy for Air Combat Missions (ATACM)",
    "Topic/tracking number": "",
    "T-Code": "4.0M",
    "TPOC": "Darrow, Josh",
    "TPOC Email": "joshua.darrow@navy.mil",
    "TPOC code": "4.10.2.2",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop AI tactics development tools for air combat to facilitate effectiveness studies by providing a fast and objective means of CONEMPs development.",
    "Description": "This effort, \"Autonomy for Air Combat Missions\", is to support the OSD ASD (R&E) Autonomy Research Pilot Initiative (ARPI) by developing machine learning methods for air combat simulations in order to derive concepts of employment (CONEMPs) for novel weapon systems.  NAVAIR 4.10 is working in collaboration with AFRL, NRL, and NAVAIR 5.4 who are applying artificial intelligence methods to Mixed Human/UAV Teams (ATACM).",
    "Primary transition type": "C - Other DoD Service/Agency takes delivery of product and funds additional development/deployment",
    "Primary transition manager": "US Air Force",
    "Funds provided by": "OSD",
    "Funding source": "Advanced Technology Development (ATD)",
    "Start date": "11-06-2013",
    "End date": "09-30-2017",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Science and Technology Gaps Analyses",
    "Core capability identifier": "",
    "Secondary core capability": "Engineering, Engagement, Mission, and Campaign Analyses",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-3: Collaborative Unmanned Strike Capability",
    "Secondary capability gap": "Theater Air and Missile Defense (TAMD)",
    "Secondary STO": "STO-1:  Anti-Air Warfare (AAW) Performance",
    "I&I": "Anti-Air Warfare (AAW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 5",
    "Estimated total funding": "$1,025,000",
    "Actual total funding": "$1,025,000",
    "Last Updated": "02-12-2016"
  },
  {
    "Project ID": 4462,
    "Title": "Online Master of Science in Computer Science",
    "Topic/tracking number": "219WFD-HE-18-043",
    "T-Code": "4.0M",
    "TPOC": "Carrico, Luke",
    "TPOC Email": "luke.carrico@navy.mil",
    "TPOC code": "4.0M.1.6",
    "Secondary TPOC": "Burgess, Samantha",
    "Secondary TPOC Email": "samantha.burgess@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Master of Science degree in Computer Science will increase modeling and data analytics capabilities provided by the 4.0M department. The degree comes with the specialization in computing system sand machine learning which will offer a strong grounding in information security, operating systems, network security, machine learning techniques, artificial intelligence, and high-performance computing.",
    "Description": "The skills that would be obtained in the MS program will be applied to this work to provide better data analysis and decisions support. The specialization in machine learning will provide knowledge and techniques that will allow the branch to build tools capable of better assisting senior leadership in making decisions. The specialization in computing systems will provide the knowledge needed to design software capable of running more efficiently in constrained situations with an added layer of security needed to better protect project data.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-20-2018",
    "End date": "08-10-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-4: Computing, Processing, and Architectures",
    "I&I": "Non-Combat Operations (NCO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$6,200",
    "Actual total funding": "$6,200",
    "Last Updated": "03-12-2019"
  },
  {
    "Project ID": 2799,
    "Title": "Collaborative Operations in Denied Environment (CODE) Program",
    "Topic/tracking number": 460770,
    "T-Code": "4.6T (Pax)",
    "TPOC": "Notaro, Joseph",
    "TPOC Email": "joseph.notaro@navy.mil",
    "TPOC code": 4.6,
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "PMA262",
    "Interested PMA(s)": "PMA262, PMA263, PMA266, PMA281 (UAS), PMA298",
    "Objective": "The CODE program plans to expand the mission capabilities of existing UAVs through increased autonomy and inter-platform collaboration. Collaborative autonomy posseses the potential to increase capabilities and reduce costs of current and currently developing UAVs by composing heterogeneous teams of UAVs that capitalize on the capabilities of each unmanned aircraft without the need to duplicate or integrate capabilities into one UAV.",
    "Description": "The DARPA CODE Program primarily focuses on the following four areas: (1) Develop autonomy for the subsystems, equipment, and flight trajectories of UAVs operating solo under routine and abnormal conditions; (2) Develop interfaces to enable mission commanders to maintain situational awareness, dynamically define mission objectives and problems, monitor progress, and provide important inputs simultaneously as necessary to several UAVs; (3) Develop UAV team-level autonomy, including producing and maintaining a common representation of the operating environment to formulate collaborative action plans that optimize the strengths of each participating UAV; (4)  Develop an Open Architecture for UAV collaboration to assist commanders in maintaining situational awareness and control of the UAVs in electronic jamming, poor communications, and adverse weather conditions.\nSpecific tasking includes: (A) Provide technical SME support to the CODE program contract phases to answer questions and concerns about 1) Human Factors Engineering & Human Systems Integration; 2) Operator Workload and Performance; 3) Modeling and Simulation; 4) UAS Test and Evaluation; 5) UAS Applied Autonomy Systems; 6)\tInteroperability\n7) Software Architecture and Engineering; 8) Avionics Systems Architecture; and 9) Machine Learning; and (B) Review and Assessment of Contractor CODE System Designs",
    "Primary transition type": "C - Other DoD Service/Agency takes delivery of product and funds additional development/deployment",
    "Primary transition manager": "DARPA",
    "Funds provided by": "DARPA",
    "Funding source": "DARPA",
    "Start date": "07-04-2014",
    "End date": "04-01-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Human Systems Design and Decision Support",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-3: Collaborative Unmanned Strike Capability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Strike Warfare (STW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 5",
    "Current TRL": "TRL 6",
    "Estimated TRL at completion": "TRL 8",
    "Estimated total funding": "$2,476,000",
    "Actual total funding": "$2,476,400",
    "Last Updated": "04-09-2019"
  },
  {
    "Project ID": 2823,
    "Title": "Aircrew Labor In-cockpit Automation System (ALIAS) Program",
    "Topic/tracking number": 460811,
    "T-Code": "4.6T (Pax)",
    "TPOC": "Notaro, Joseph",
    "TPOC Email": "joseph.notaro@navy.mil",
    "TPOC code": 4.6,
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "PMA202, PMA205",
    "Objective": "ALIAS envisions a tailorable, drop-in, removable kit that permits the addition of high levels of automation into existing aircraft, and enables aircraft and mission operations with reduced onboard crew.",
    "Description": "i.\tProvide support to the ALIAS program contract phases to answer questions and address concerns in the following engineering areas:\n\n1)\tCockpit and Crew Station Technologies\n2)\tHuman Factors Engineering & Human Systems Integration\n3)\tOperator Workload and Performance\n4)\tSimulation\n5)\tUAS Applied Autonomy Systems\n6)\tInteroperability\n7)\tSoftware Engineering\n8)\tAvionics Systems Architecture\n9)\tMachine Learning\n\nii.\tALIAS Program activity support entails the following efforts:\na.\tReview and Assessment of Contractor Proposals of System Requirements Definitions and Preliminary System Designs\ni.\tIncludes On-site Coordination and Support of Review Package Completion\nii.\tSupport of ALIAS Program Manager in Determination and Selection Critical Technology Developers\niii.\tSupport of Kick-off Meetings, Weekly and Quarterly Progress Meetings, and Technical Meetings and Exchanges IAW ALIAS Program Manager Requirements",
    "Primary transition type": "C - Other DoD Service/Agency takes delivery of product and funds additional development/deployment",
    "Primary transition manager": "DARPA",
    "Funds provided by": "DARPA",
    "Funding source": "DARPA",
    "Start date": "10-01-2014",
    "End date": "12-31-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Human Systems Design and Decision Support",
    "Core capability identifier": "",
    "Secondary core capability": "Warfighter Protection, Performance, and Survivability",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-3: Vertical Lift Platform Enablers",
    "Secondary capability gap": "Naval Warrior Performance (NWP)",
    "Secondary STO": "STO-2: Human Systems Design and Decision Support",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 6",
    "Estimated TRL at completion": "TRL 8",
    "Estimated total funding": "$300,000",
    "Actual total funding": "$352,100",
    "Last Updated": "12-19-2018"
  },
  {
    "Project ID": 3514,
    "Title": "Reactive Electronic Attack Measures (REAM)",
    "Topic/tracking number": "AW-FY16-04",
    "T-Code": "NAVAIR",
    "TPOC": "O'Reagan, Bill",
    "TPOC Email": "william.oreagan@navy.mil",
    "TPOC code": "4.0T",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "PMA234",
    "Interested PMA(s)": "",
    "Objective": "Deliver techniques to identify hidden or new radar threats and modes.",
    "Description": "Automatically respond with an effective EA technique in a tactical relevant time frame. REAM will be capable of prioritizing threats in a many threat scenario and derive efficient receive and transmit resource solutions. State-of-the-art technologies will be developed to identify new threats, prioritize and counter advanced threats using machine learning logic.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA234",
    "Funds provided by": "Navy",
    "Funding source": "Future Naval Capabilities (FNC)",
    "Start date": "10-01-2015",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-2: Fixed Wing Platform Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$0",
    "Actual total funding": "$19,572,000",
    "Last Updated": "09-11-2018"
  },
  {
    "Project ID": 3579,
    "Title": "Physics-Based Maritime Target Classification and False Alarms Mitigation",
    "Topic/tracking number": "N161-018",
    "T-Code": "4.5T",
    "TPOC": "Allen, Oliver",
    "TPOC Email": "oliver.allen@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Skaggs, Lee",
    "Secondary TPOC Email": "herman.skaggs@navy.mil",
    "Portfolio": "PEO(A)-ASW",
    "Primary supporting PMA": "PMA290",
    "Interested PMA(s)": "PMA299 (ASW)",
    "Objective": "Develop near real-time computationally efficient machine learning techniques to significantly improve classification performance of Inverse Synthetic Aperture Radar (ISAR) imagery Synthetic Aperture Radar (SAR) imagery and High Range Resolution (HRR) based maritime classification aids in the presence of vessels not resident in an existing classification database from returns.",
    "Description": "Improved maritime situational awareness is an ongoing Navy operational need. Current state of the art maritime classification aids using ISAR, SAR and HRR returns rely on extensive databases containing individual vessel dimensional information (i.e., length overall, superstructure(s) location and dimensions, mast(s) positions). When presented with vessels not in the database inability to classify or improper classification may result. In some instances the particular fine-class of vessel may be resident in the database but subtle variations of the topside configuration generate classification challenges. Here we seek to leverage the complex-valued radar returns from a limited number of viewing angles and knowledge of scattering physics of canonical shapes (e.g., point scatters, dihedrals, trihedrals, flash, multiple poles, etc.) to develop a physical description of the vessel suitable for inclusion in the classification database. The complex-valued radar returns should map directly into a description of surface feature such as edges, corners and gaps. The objective is to accomplish this task in near real-time using machine learning approaches capable of being hosted on legacy maritime radar systems (APY-10, APS-153, ZPY-4 or ZPY-3) which may have limited computing resources.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "06-02-2016",
    "End date": "12-15-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Radar and Antenna Systems Capability",
    "Core capability identifier": "",
    "Secondary core capability": "Sensor and Data Fusion",
    "Secondary core capability identifier": "",
    "Capability gap": "Surface Warfare (SUW)",
    "STO": "STO-1:  Maritime Surveillance and Interdiction",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Anti Surface Warfare (ASuW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$0",
    "Actual total funding": "$975,841",
    "Last Updated": "10-01-2018"
  },
  {
    "Project ID": 3783,
    "Title": "Automated Code and Architecture Refactoring Software (ACARIS)",
    "Topic/tracking number": "N171-012",
    "T-Code": "4.1T",
    "TPOC": "Ramsay, BJ",
    "TPOC Email": "bryan.ramsay@navy.mil",
    "TPOC code": "PMA281",
    "Secondary TPOC": "Selzer, Fred",
    "Secondary TPOC Email": "frederick.selzer.ctr@navy.mil",
    "Portfolio": "PEO(U&W)-Weapons",
    "Primary supporting PMA": "PMA281 (Weapons)",
    "Interested PMA(s)": "",
    "Objective": "In order to prove the feasibility of the ACARIS concept and demonstrate its applicability and\neffectiveness as an automatic refactoring software, ATC-NY will accomplish the following technical objectives:\n1. Research and select compiler to generate AST\n2. Implement improper code structure identification component\n3. Implement automated refactoring component\n4. Develop proof-of-concept demonstration\n5. (Option) Implement machine learning\n6. (Option) Implement architecture-level identification of refactoring opportunities\nThe core challenge of Phase I is demonstrating that our approach of building an artificial intelligence refactoring engine will automatically refactor legacy code to be faster and more suitable for newer technologies.",
    "Description": "ATC-NY, together with their parent company, Architecture Technology Corporation, will develop the Automated Code and Architecture Refactoring Software (ACARIS), an automated refactoring tool that analyzes the source code of an application, identifies code structures that can be defined as “code smells” or that would benefit from parallelization, and automatically refactors and/or multithreads any code structures that do not have any external dependencies. Structures that do have dependencies and cannot be automatically refactored will be returned to the user in a list so the user can manually refactor those structures or resolve any dependencies and send the code back through the ACARIS refactoring component. ACARIS also analyzes the architecture of the application and identifies opportunities for refactoring the code to improve the architecture and transition to a more open, service-oriented architecture.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA281 (Weapons)",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "05-24-2017",
    "End date": "06-22-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Development of Qualified Full Life Cycle Acquisition Engineering Leads, Tools, Processes, and Advancements",
    "Core capability identifier": "",
    "Secondary core capability": "Development of Systems Software (SW) Qualified Engineers, Tools, Processes, and Advancements",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-1:  Responsive Engagement",
    "Secondary capability gap": "Enterprise and Platform Enablers (EPE)",
    "Secondary STO": "STO-1: Enterprise Enablers",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "Strike Warfare (STW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "$974,489",
    "Last Updated": "03-11-2019"
  },
  {
    "Project ID": 3819,
    "Title": "Famim Talukder -  Ph.D. in Computer Science at The University of Notre Dame",
    "Topic/tracking number": "219WFD-HE-17-022",
    "T-Code": "4.3T",
    "TPOC": "Schork, William",
    "TPOC Email": "william.schork@navy.mil",
    "TPOC code": "AIR-4.3.2.2",
    "Secondary TPOC": "Talukder, Famim",
    "Secondary TPOC Email": "famim.talukder@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Obtain a Ph.D. in Computer Engineering from the University of Notre Dame.",
    "Description": "FY17:  Labor:  $12.54k; Tuition: $26k; Books: $0.9k\nFall Semester 2017:   \tCSE 30341 – 3 Credits – Operating Systems Principles (Undergrad)\nCSE 40113 – 3 Credits – Design and Analysis of Algorithms (Undergrad)\nCSE 60625 – 3 Credits – Machine Learning\n3 Graduate Level Research Credits (Establishes a relationship with Ph.D. Advisor)\n\nNote:  Since Mr. Talukder’s undergraduate degree is in Aerospace Engineering he is required to complete 3 undergraduate courses to prepare him for his graduate studies in Computer Science Engineering.  \n\nFY18:  Labor:  $68.35k; Tuition: $52k; Books: $1.8k\nSpring Semester 2018:\tCSE 30321 – 4 Credits – Computer Architecture (Undergrad)\nCSE 60111 – 3 Credits – Complexity and Algorithms\nCSE 60641 – 3 Credits – Graduate Operating Systems\n\nFall Semester 2018:  \tCSE 60277 – 3 Credits – Applied Pattern Recognition\nCSE 60321 – 3 Credits – Advanced Computer Architecture\nCSE 60333 – 3 Credits – Mobile Application Projects\n\nFY19:   Labor:  $56.95k; Tuition: $29.6k; Books: $0.9k\nSpring Semester 2019:\tCSE 60535 – 3 Credits – Computer Vision\nCSE 60171 – 3 Credits – Artificial Intelligence\n\t\t\tCSE 60943 – 3 Credits – Autonomous Mobile Robots\n\nFall Semester 2019:\t5 Research Credits\n\nFY20: Tuition:  $7.2k\nSpring Semester 2020:\t5 Research Credits\nFall Semester 2020:\t5 Research Credits\n\nFY21: Tuition:  $7.2k\nSpring Semester 2021\t5 Research Credits\nFall Semester 2021\t5 Research Credits\n\nFY22: Tuition: $3.6k (STAIRS will not let me include this in FY2022)\nSpring Semester 2022\t5 Research Credits",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.3",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-12-2017",
    "End date": "12-31-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": "3.4.2",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$263,400",
    "Actual total funding": "$289,439",
    "Last Updated": "10-31-2018"
  },
  {
    "Project ID": 3785,
    "Title": "Intelligent Source Code Refactoring for Mission Packages (I-SCRUM)",
    "Topic/tracking number": "N171-012 (b)",
    "T-Code": "4.1T",
    "TPOC": "Ramsay, BJ",
    "TPOC Email": "bryan.ramsay@navy.mil",
    "TPOC code": "PMA281",
    "Secondary TPOC": "Selzer, Fred",
    "Secondary TPOC Email": "frederick.selzer.ctr@navy.mil",
    "Portfolio": "PEO(U&W)-Weapons",
    "Primary supporting PMA": "PMA281 (Weapons)",
    "Interested PMA(s)": "",
    "Objective": "The need exists to augment and leverage existing technology capabilities embedded in software systems so that it can be dynamically repurposed to support multiplatform mission development, including mission planning for manned and unmanned aircraft. This proposal seeks to apply Big-Data techniques, especially Machine Learning coupled with Feature Identification, to the problem of rapidly obtaining critical mission planning information from disparate systems by utilizing machine learning to dynamically harvest data access algorithms and rapidly refactor them for use in mission planning.",
    "Description": "Phase I will involve\nReview the attributes of JMPS to verify our assumptions and fully understand the problem space.\n Revisit our assumptions made during this proposal creation and, if necessary update those\nassumptions to conform with the state of the art. This is especially important when dealing with Open Source Software (OSS) as we have found that OSS can advance rapidly, or occasionally may become orphaned. In the case of orphaned software, we will choose to adopt and support or find a suitable replacement.\nCreate a testbed to begin development of the product.\nDevelop a trivial use case for the device which may be testable during Phase I.\nStart bread boarding the tasks necessary to demonstrate the use case.\nImplement the test case.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA281 (Weapons)",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "05-24-2017",
    "End date": "12-01-2017",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Development of Systems Software (SW) Qualified Engineers, Tools, Processes, and Advancements",
    "Core capability identifier": "",
    "Secondary core capability": "Development of Qualified Full Life Cycle Acquisition Engineering Leads, Tools, Processes, and Advancements",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-1:  Responsive Engagement",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-1: Command and Control",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "Strike Warfare (STW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "",
    "Last Updated": "07-27-2017"
  },
  {
    "Project ID": 3471,
    "Title": "Peter Arslanian - Master’s Degree in Aerospace Engineering at the University of Maryland",
    "Topic/tracking number": "219WFD-HE-16-021",
    "T-Code": "4.3T",
    "TPOC": "Arslanian, Peter",
    "TPOC Email": "peter.arslanian@navy.mil",
    "TPOC code": "4.3.2.6",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Obtain a Master of Aerospace Engineering degree from the University of Maryland.",
    "Description": "Funding will be used to pay for tuition and books associated with pursuing a Master’s Degree in Aerospace Engineering from The University of Maryland, College Park.\n\nFY16 \nFall Semester 2016\tMATH461 Linear Algebra For Scientists and Engineers\nMaterials Cost: Tuition - $3.0k  Books - $0.3k\nNote:  Should FY16 Section 219 Sweep-up funding be available, the plan is to take this course during Fall 2016. The proposed FY16 course will provide a solid foundation for entry into the Master’s Degree Program.\n\nFY17\nSpring Semester 2017:\tENEE 425 Digital Signal Processing (3 Credits)\nENEE 496 Lasers and Electro-optic Devices (3 Credits)\nSummer Semester 2017:\tENEE 620 Random Processes in Communication and Control (3 Credits)\nFall Semester 2017:\tENEE 621 Estimation and Detection Theory (3 Credits)\n\t\t\tENEE 630 Advanced Digital Signal Processing (3 Credits)\nLabor Cost:  $5.3k   Materials Cost: Tuition - $14.2k   Books - $1.5k\nNote: Due to limited course availability at the Higher Education Center, it may be necessary to take classes at the UMD College Park campus.  Therefore, this proposal is requesting limited labor funding to cover actual time spent at the College Park Campus attending classes. In the event that the proposal evaluation board declines this request for labor, a request is made that the board still consider the request for funding to cover tuition and books.\n\nFY18\nSpring Semester 2018:\tENEE 631 Digital Image and Video Processing (3 Credits)\n\t\t\tENAE 670 Fundamentals of Aerodynamics (3 Credits)\nSummer Semester 2018:\tENAE 640 Atmospheric Flight Mechanics (3 Credits)\nFall Semester 2018:\tENAE 641 Linear System Dynamics (3 Credits)\n\t\t\tCMSC 422 Introduction to Machine Learning (3 Credits)\nLabor Cost:  $5.4k   Materials Cost: Tuition - $14.2k   Books - $1.5k\nNote: Due to limited course availability at the Higher Education Center, it may be necessary to take classes at the UMD College Park campus.  Therefore, this proposal is requesting limited labor funding to cover actual time spent at the College Park Campus attending classes. In the event that the proposal evaluation board declines this request for labor, a request is made that the board still consider the request for funding to cover tuition and books.\n\nFY19\nSpring Semester 2019:\tENAE 642 Atmospheric Flight Control (3 Credits)\n\t\t\tNACS 641 Introduction to Neurosciences (3 Credits)\nFall Semester 2019:\tCMSC 426 Image Processing (3 Credits)\nNACS 643 Computational Neuroscience (3 Credits)\n\t\t\t\nLabor Cost:  $5.4k   Materials Cost: Tuition - $11.2k   Books - $1.2k\nNote: Due to limited course availability at the Higher Education Center, it may be necessary to take classes at the UMD College Park campus.  Therefore, this proposal is requesting limited labor funding to cover actual time spent at the College Park Campus attending classes. In the event that the proposal evaluation board declines this request for labor, a request is made that the board still consider the request for funding to cover tuition and books.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-01-2016",
    "End date": "09-30-2019",
    "Project status": "Suspended (Technical Effort Awaiting)",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": 3,
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "Secondary STO": "STO-2: Total Ownership Cost",
    "I&I": "Mobility (MOB)",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$63,200",
    "Actual total funding": "$25,378",
    "Last Updated": "10-04-2018"
  },
  {
    "Project ID": 3786,
    "Title": "Mission Planning Software - Next Generation (MPS-NG)",
    "Topic/tracking number": "N171-012 (c)",
    "T-Code": "4.1T",
    "TPOC": "Ramsay, BJ",
    "TPOC Email": "bryan.ramsay@navy.mil",
    "TPOC code": "PMA281",
    "Secondary TPOC": "Selzer, Fred",
    "Secondary TPOC Email": "frederick.selzer.ctr@navy.mil",
    "Portfolio": "PEO(U&W)-Weapons",
    "Primary supporting PMA": "PMA281 (Weapons)",
    "Interested PMA(s)": "PMA281 (Weapons)",
    "Objective": "To address need to develop an advanced software refactoring algorithm, using artificial intelligence (AI) technology or other similar innovative development approach, to facilitate transition of legacy mission planning software to a capabilities based, open architecture, next generation mission planning software suite supporting both manned an unmanned operations. PMATs proposed solution, Mission Planning Software - Next Generation, will evaluate and integrate multiple technologies to facilitate machine learning and AI technologies through combining PMAT's Intelligence Collaboration and Analytics Platform (ICAP) open architectural framework and data fusion capabilities with SparkCognition's machine learning and advanced algorithms solution SparkPredict(TM) solution. Research of the Mission Planning System - Next Generation will consist of four technical objectives needed to repurpose and integrate ICAP and SparkPredict(TM) to integrate real-time machine learning and AI aided advanced refactoring to support time dominate operational mission planning. These objectives include the development of a conceptual planning model, conceptual workflows, refactoring technology to support backwards planning, and prototype development. Each technical objective support the identification of associated operational risk and mitigation plans to support include feasibility prototypes and experiments.",
    "Description": "The anticipated benefit includes increased speed to decision-making within a time-dominant, multi faceted operational space for both manned and unmanned systems. PMATs commercialization strategy to support this project through Phase III transition will focus largely towards the DoD Services as the Army, Navy, Air Force, and Marine Corps require many of the same planning functions within their respective C2, Combat Systems (CS), logistics systems and ISR systems and Programs of Record such as MTC2, CAC2S, and DCGS. Based on the success of Phase I and Phase II efforts, transitioning the planning framework will provide the Joint Services as well as supporting agencies such as NGA, NSA, DHS, with a tool that will support the ability to exploit large amounts of data to optimize planned or rapid response operations. The Mission Planning Software - Next Generation software tool could be suitable for applications in various government agencies and the commercial market sector using shipping and mailing services that would benefit from technology capable of major software refactoring of complex legacy codes. SparkCognition currently supports several commercial entities to include Fortune 500 companies with their SparkPredict(TM) solution. This effort will only serve to increase its commercial viability.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA281 (Weapons)",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "05-24-2017",
    "End date": "12-01-2017",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Development of Systems Software (SW) Qualified Engineers, Tools, Processes, and Advancements",
    "Core capability identifier": "",
    "Secondary core capability": "Development of Qualified Full Life Cycle Acquisition Engineering Leads, Tools, Processes, and Advancements",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-1:  Responsive Engagement",
    "Secondary capability gap": "Strike Operations (STK)",
    "Secondary STO": "STO-3: Collaborative Unmanned Strike Capability",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "Strike Warfare (STW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$125,000",
    "Actual total funding": "",
    "Last Updated": "06-27-2017"
  },
  {
    "Project ID": 4074,
    "Title": "Risk-Based Unmanned Air System (UAS) Mission Path Planning Capability",
    "Topic/tracking number": "N17B-T034",
    "T-Code": "4.3T",
    "TPOC": "Leonard, John",
    "TPOC Email": "john.r.leonard2@navy.mil",
    "TPOC code": "4.3.2.4",
    "Secondary TPOC": "Tritschler, John",
    "Secondary TPOC Email": "john.tritschler@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "PMA263",
    "Interested PMA(s)": "PMA262, PMA264, PMA268",
    "Objective": "Develop an Unmanned Air System (UAS) pre-flight mission planning capability that utilizes path planning algorithms to minimize risk to personnel and property during UAS flight operations while reducing preparation times.",
    "Description": "The Navy continues to increase its UAS fleet with new air vehicle systems of various sizes, capabilities, and maturity.  UAS  do not meet the airworthiness standards    that allow manned aircraft to fly within the National Airspace with minimal restrictions placed on flight plans by real-time air traffic control.  As a result, UAS operations are typically limited to very restrictive operational areas (e.g. maritime operations and in Active Restricted and Warning Areas) due to risk to personnel and property on the ground.  When missions necessitate operation outside of these areas, it can be particularly challenging and time-prohibitive to develop mission plans that ensure proper levels of safety.  These constraints significantly limit Navy UAS operations for research, test and evaluation, and fleet operations; therefore, advanced and robust technologies are needed to efficiently create mission flight path plans that enable safe UAS operations within the US National and Foreign Airspaces.\n\nCurrent mission path planning capabilities are primarily air vehicle (AV) centric and rely on human judgment to assess the appropriateness of a given mission plan within a broader context.  The UAS air vehicle operator (AVO) is responsible for: 1) defining a complete mission plan prior to flight for autonomous execution, 2) investigating and assessing the risk to personnel and property on the ground using limited information, and 3) continuously monitoring the mission execution (and potentially intervening) for mission changes, vehicle failures, and/or airspace conflicts.  The level of safety for a given mission, therefore, depends largely on an individual AVO’s ability to synthesize a myriad of data elements and promptly determine and execute the best course of action.  Mission planning tools to assist the AVO in the synthesis of such data will improve the overall level of safety of UAS operations, reduce pre-flight manpower requirements, and enable broader integration of UAS within US National and Foreign Airspaces.\n\nMission path planning capabilities and algorithms are needed to improve and standardize the Navy’s UAS mission planning process, especially to minimize the risk to personnel and property that is independent of, and dependent on, the air vehicle.  Potential technologies exist in the academic and industry communities for robotic control, machine learning, data fusion, and numerical optimization that can reduce the complexity of AVO path planning tasks.  The risk-based algorithms, and associated technologies, need to be scalable from basic 2-D assessments (e.g. population data) to multidimensional optimization problems that handle mission/vehicle constraints (e.g. vehicle speeds, weight, size, maneuvering capabilities, atmospheric winds, and sensor requirements  ) and risk-based information uncertainties (e.g. inferring population densities from FAA Sectionals).  Initial algorithm development may start with analysis of alternatives, and/or generic algorithm class representations to support the further development of the chosen technologies.  The algorithm(s) will address flight path safety during normal flight and during contingency operations, including robustness to air vehicle failures and risk-based data uncertainties (e.g. population density data).",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA263",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "STTR",
    "Start date": "09-25-2017",
    "End date": "02-01-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": "3.4.4",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "$724,732",
    "Last Updated": "12-04-2018"
  },
  {
    "Project ID": 660,
    "Title": "Adaptive Learning for Stall Pre-cursor Identification and General Impending Failure Prediction",
    "Topic/tracking number": "N10A-T008",
    "T-Code": "4.4T",
    "TPOC": "Godlewski, Paul",
    "TPOC Email": "paul.godlewski@navy.mil",
    "TPOC code": "4.4.7.1",
    "Secondary TPOC": "Mason, Steve",
    "Secondary TPOC Email": "steven.mason1@navy.mil",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "Develop innovative computational tools for the analysis of performance and usage data to predict aircraft engine stall",
    "Description": "Modern propulsion systems for Naval Aviation, full authority digital engine control [FADEC] systems, and supporting health management systems have the capability to collect and analyze large datasets of engine performance and usage information. This data offers the potential to detect impending failures and component performance degradation in flight and post-flight and flag these for compensation by the engine control system. This could also help to provide more timely maintenance attention which would positively impact operational availability, reliability, and safety. An example of a primary concern is intermittent gas turbine engine compressor stall (due to gradual component wear and fouling in service) that causes mission aborts and results in extensive troubleshooting at the flight line.     Innovative computational tools are needed for the analysis of performance and usage data to predict aircraft engine stall. These tools should allow time for control system software to take preemptive corrective action in order to avoid engine stall events, as well as identify and assess the state of the engine components causing this behavior and estimate the remaining useful life (RUL) of these critical engine components. Machine and adaptive learning techniques, effective searching algorithms of engine large data sets, statistical analysis methods, and adaptive neural networks are some of the tools seen to have promise for attacking this problem.     The proposed computational tools should be able to provide diagnostics and prognostics of aircraft engines, modules, subsystems, and components. The tools should also be able to: conduct failure mode and effects analysis to identify the failure modes and root causes and assess their impact; use machine learning techniques and neural networks to extract rules and knowledge underlying the available engine large data sets; predict impending engine stall events and other types of performance degradation, and estimate remaining useful life of the critical components driving the degrades engine performance; verify the performance and accuracy of the results against the available engine data sets; adaptively learn from newly generated engine data; inform engine maintenance staff and field engineers of imminent problems; interface seamlessly with the current engine FADEC and other hardware systems; and provide engine designers with field-data based feedback to enable them to improve the design of current FADEC systems and future propulsion systems.      *TECHNOLOGY APPROACH imported from Legacy S&T: Approach 1:  Utilize a neural network to detect patterns in sensor data to identify a developing stall and to predict component health.    Approach 2:  Compute component health and predict stalls by comparing sensor data with real-time model data.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "STTR",
    "Start date": "07-30-2010",
    "End date": "02-28-2011",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "Highly Integrated Control Systems",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$0",
    "Actual total funding": "$139,916",
    "Last Updated": "09-29-2014"
  },
  {
    "Project ID": 4011,
    "Title": "ADV TECH: Machine Learning applications to Combat Identification",
    "Topic/tracking number": "219BAR-18-027",
    "T-Code": "4.5T",
    "TPOC": "Rea, Charles",
    "TPOC Email": "charles.rea@navy.mil",
    "TPOC code": "4.5.5.3",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Objective: Investigate Artificial Intelligence techniques and how they can improve feature aided fusion. The advancement of Artificial intelligence through better understanding of Neural Networks, Deep Learning, and Machine learning has been driving industry forward in a number of ways, specifically improved computer vision techniques that allow autonomous driving on public roads (lane assist, adaptive cruise control). Deep learning (ex. convolutional neural networks) has grown in capability to tackle complex, partially observable, games better than the BEST humans. This project will grow the Sensor Fusion Branch’s (4.5.5.3) understanding of Artificial Intelligence for application to mission critical detection and identification techniques performed on data collected by Naval platforms during mission execution.",
    "Description": "FY18 OBJECTIVE: Proof of concept, show that a machine learning algorithm can discern object type/class from multi-dimensional feature data. All work will be conducted by Principle Investigator and Developmental Employee working in tandem.\n\tTask 1: (0.1MY) Utilizing MATLAB create an M&S environment applicable to this problem\nTask 2: (0.05MY) Model the problem\nTask 3: (0.05MY) Extract feature data from M&S environment\nTask 4: (0.1MY) Create Machine Learning software\nTask 5: (0.05MY) Train Machine Learning software using simulated data sets\nTask 6: (0.05MY) Test Machine Learning software against different simulated data sets\nTask 7: (0.04MY) Repeat tasks 5 and 6 to improve the algorithms’ robustness\nTask 8: (0.01MY)\tDemonstrate success and applicability to operational data\nTask 9: (0.05MY, $10k Travel) Prepare and publish white papers on sensor fusion aspects of artificial intelligence algorithm development to Fusion 2018\nMISC: $5k Lab fee for using data fusion laboratory equipment and support\n\nFY19 OBJECTIVE: Apply Machine Learning Algorithms from FY18 to operational data. All work will be conducted by Principle Investigator and Developmental Employee working in tandem.\nTask 1: (0.05MY)\tTake knowledge gained in FY18 and acquire as data. Author has contacts with PMA-231, PMA-262, PMA-265, PMA-290, PMA-290E, NRL, and ONR who are interested in the results and will supply data. The study will target exercises with disparate platforms and data types. Ex. Netted Sensors ‘17\nTask 2: (0.1MY)\tIncorporate any new data types acquired by Task 1 into algorithms. \nTask 3: (0.1MY)\tDetermine training set and supervise learning\nTask 4: (0.1MY)\tTest the algorithms against exercise data and operational results. Does the algorithm reach a conclusion prior to operators? Is it correct?\nTask 5: (0.05MY)\tTune algorithms, acquire more data, etc. from lessons learned above.\nTask 6: (0.05MY)\tIdentify a FLEX event for live participation\nTask 7: (0.05MY, $10k Travel) Prepare and publish white papers on sensor fusion aspects of artificial intelligence algorithm development to Fusion 2019\nMISC: $6k Lab fee for using data fusion laboratory equipment and support\n\nFY20 OBJECTIVE: Live demonstration of algorithms during a Live, Virtual, Constructed FLEX event. All work will be conducted by Principle Investigator and Developmental Employee working in tandem.\n\tTask 1: (0.15MY)\tCoordinate participation in FLEX with assets\n\tTask 2: (0.15MY)\tParticipate in FLEX\n\tTask 3: (0.1MY)\tAnalyze FLEX results\n\tTask 4: (0.05MY)\tPrepare briefs for leadership on results\nTask 5: (0.05MY, $10k Travel) Prepare and publish white papers on sensor fusion aspects of artificial intelligence algorithm development to Fusion 2020\nMISC: $6k Lab fee for using data fusion laboratory equipment and support",
    "Primary transition type": "I - Basic research exempt",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2017",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Radar and Antenna Systems Capability",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-4: Computing, Processing, and Architectures",
    "I&I": "Strike Warfare (STW)",
    "Secondary I&I": "Intelligence (INT)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$372,300",
    "Actual total funding": "$457,652",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 4008,
    "Title": "R&S: An Aircraft Health and Readiness Analyzer of Flight Safety-Critical Components",
    "Topic/tracking number": "219BAR-18-024",
    "T-Code": "4.5T",
    "TPOC": "Presler, Roy",
    "TPOC Email": "roy.presler@navy.mil",
    "TPOC code": "4.5.14",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop a novel Aircraft Health and Readiness Analyzer of Flight Safety-Critical Components based on the innovative application of passive Anti-Submarine Warfare (ASW) tools and techniques developed for underwater search, track, localizing and classifying submerged threats. TheObjective: Develop a novel Aircraft Health and Readiness Analyzer of Flight Safety-Critical Components based on the innovative application of passive Anti-Submarine Warfare (ASW) tools and techniques developed for underwater search, track, localizing and classifying submerged threats. The system provides situational awareness on the conditions and prognostic indication of potential failure of an aircraft’s flight safety-critical component, e.g., rotor, gears, and drivetrain components.",
    "Description": "FY18 - $151.88K Labor/$4.98K Travel/$4.4K Material\na)\tInitial Research Phase, Recording\ni)\tDetermine optimal microphone location to record and monitor flight safety-critical aircraft component signatures. Performed by: Roy Presler, Tobias Thatcher, and Luis Fortuño\nii)\tRecord flight safety-critical aircraft component signatures in during normal operating conditions covering different flight modes. Performed by: Roy Presler, Tobias Thatcher, and Luis Fortuño\n\nb)\tInitial Research Phase, Data Analysis\ni)\tDevelop a signature baseline of normal flight safety-critical aircraft components. Performed by Roy Presler, Tobias Thatcher, and Luis Fortuño.\nii)\tAnalyze recordings and develop signature characteristics, i.e., frequency, bandwidth, modulation, and amplitudes. Performed by Roy Presler, Tobias Thatcher, and Luis Fortuño. \niii)\tReview aircraft maintenance records for correlations between component maintenance actions, time on aircraft, and aircrew or maintenance observations. Performed by Roy Presler and Adam Barrett.  \nFY19 - $152.64 Labor/$4.98K Travel/$0K Material\na)\tDevelop and train algorithms to prognosticate the health of the component.\ni)\tDevelop machine learning techniques that allow the algorithm to detection and alert user. Performed by Roy Presler and Tobias Thatcher, and Luis Fortuño.\nii)\tTest algorithm’s robustness and resiliency to extraneous noise. Performed by Roy Presler, Tobias Thatcher, and Luis Fortuño.\nb)\tNoise Profile Data Analysis. Performed by Roy Presler, Tobias Thatcher, Adam Barrett, and Luis Fortuño.\nc)\tDocument activities and findings.  Performed by Roy Presler Tobias Thatcher, and Adam Barrett.\nFY20 - $153.18 Labor/$4.98K Travel/$4.4K Material\na)\tDevelop demonstration prototype acoustic health monitoring system \ni)\tDevelop demonstration prototype acoustic health monitoring system. Performed by Roy Presler, Tobias Thatcher, Adam Barrett, and Luis Fortuño. \nii)\tTest demonstration prototype acoustic health monitoring system. Performed by Roy Presler, Tobias Thatcher, Adam Barrett, and Luis Fortuño. \nb)\tReport/Brief Generation\ni)\tBrief findings to PEO(A), PMA-299, NAWCAD-4.3, and 4.5. Performed by Roy Presler, Tobias Thatcher, Adam Barrett, and Luis Fortuño.\nii)\tArticle preparation and submission to NAVAIR Journal. Performed by Roy Presler, Tobias Thatcher, Adam Barrett, and Luis Fortuño.\niii)\tPrepare Final Report. Performed by Roy Presler, Tobias Thatcher, Adam Barrett, and Luis Fortuño.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA299 (ASW)",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2017",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Airborne Anti-Submarine Warfare (ASW)",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "Under Sea Warfare (USW)",
    "Secondary STO": "STO-1:  Environmental Sensing, Assimilation and Tactical Decision Aids",
    "I&I": "Anti-Submarine Warfare (ASW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$481,500",
    "Actual total funding": "$480,837",
    "Last Updated": "01-31-2019"
  },
  {
    "Project ID": 3943,
    "Title": "A hybrid classification approach using down-sampling techniques and tuned hyperparameters on imbalanced datasets (F/A-18 Physiologic Episode)",
    "Topic/tracking number": "219BAR-18-014",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Lerma, Nelson",
    "TPOC Email": "nelson.lerma@navy.mil",
    "TPOC code": "4.6.2.2",
    "Secondary TPOC": "Adams, Matthew",
    "Secondary TPOC Email": "matthew.p.adams@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Investigate multiple sampling techniques and hyper parameter settings for a set of machine learning algorithms (MLA) across an imbalanced dataset, specifically for the F/A-18 Environment Control System (ECS)-related memory unit data.  This study will develop a model by using down-sampling techniques and tuned hyper parameters on imbalanced sets that yields a high predictive power of Physiological Events (PE). The model will then be documented in a final tech report made available to the S&T community and submitted to a peer-reviewed publication.",
    "Description": "RATE\t\tHOURS        TRAVEL\tTOTAL\nFY18: Task 1: Data Generation \n\t4.6.2.2 Matt Adams \t\t$73.94\t\t140\t     $0\t\t$10,189\n\t4.6.2.2 Matt Proetsch\t\t$0*\t\t200*\t     $0\t\t$0\t\t\n\t4.6.2.2 Nelson Lerma\t\t$73.94\t\t140\t     $0\t\t$10,189\n\nFY18: Task 2: Analysis of Machine Learning \n           & Sampling Techniques \n\t4.6.2.2 Matt Adams \t\t$73.94\t\t140\t     $0\t\t$10,189\n\t4.6.2.2 Matt Proetsch\t\t$0*\t\t200*\t     $0\t\t$0\t\t\n\t4.6.2.2 Nelson Lerma\t\t$73.94\t\t140\t     $0\t\t$10,189\n\nFY18: Task 3: Tuning Hyperparameters\t\n\t4.6.2.2 Matt Adams \t\t$73.94\t\t140\t      $0\t\t$10,189\n\t4.6.2.2 Matt Proetsch\t\t$0*\t\t200*\t      $0\t\t$0\t\t\n\t4.6.2.2 Nelson Lerma\t\t$73.94\t\t140\t      $0\t\t$10,189\n\nFY18: Task 4: Application to F/A-18 Dataset\n\t4.6.2.2 Matt Adams \t\t$73.94\t\t140\t      $2500\t$10,189\n\t4.6.2.2 Matt Proetsch\t\t$61.20\t\t207\t      $2500\t$12,668\t\t\n\t4.6.2.2 Nelson Lerma\t\t$73.94\t\t140\t      $2500\t$10,189\n\nFY18: Service Cost Center Recovery \n\tWSIL\t\t\t\t\t\t\t\t\t$29,545\t\t\n_________________________________________________________________________________________\nTotal (not including Matt Proetsch for task 1-3)\t\t1,327\t      \t\t$ 131,226\n\n*Matt Proetsch is currently an intern and does not graduate until July 2018 at which point he will begin to charge to the project. \n\nTravel Cost- The travel cost associated with proposal is to support two trips to PAX River, specifically to the CBM+ Lab, where the application of the sampling techniques and tuned hyperparameter MLA will be applied to the FA-18 Dataset. \n\nMaterial Cost- The material cost included in this proposal is to support of the service cost center reimbursement. This includes laboratory operating and support costs including system administration, information assurance, hardware maintenance, and software licensing.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.6",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2017",
    "End date": "09-30-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "HPM and Human Performance Assessment (HPA)",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$131,300",
    "Actual total funding": "$97,102",
    "Last Updated": "01-05-2018"
  },
  {
    "Project ID": 3934,
    "Title": "ADV TECH: Deep Learning for Enhanced Perception of Autonomous Shipboard Systems (DeLEPASS)",
    "Topic/tracking number": "219WFD-SG-18-033",
    "T-Code": "4.8T",
    "TPOC": "Hart, Kyle",
    "TPOC Email": "kyle.m.hart@navy.mil",
    "TPOC code": "4.8.1.4",
    "Secondary TPOC": "Kumia, Nicholas",
    "Secondary TPOC Email": "nicholas.b.kumia@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The objectives of this three year cross-competency Workforce Development (WFD) proposal are to develop a working level understanding of the theory behind Deep Learning through online resources and to develop technical competence in the application of Deep Neural Networks (DNNs) using commercial off the shelf (COTS) Deep Learning Frameworks, software, and GPU hardware. The deliverables of the project will be a report on the applicability of deep learning to certain NAWCAD mission areas as well as a machine vision system prototype capable of the detection and recognition of aircraft and personnel in camera recordings of aircraft carrier flight deck operations.",
    "Description": "Executor: 1 – Dr. James Hing, 2.Jeff Bennett, 3. Kyle Hart, 4. Jacques Severe, 5. Matt Cusick, 6. Ralph Smith\nLearning of Fundamentals and Training on Software / Hardware_x00B_Task 1.1: Execute online and published training on the Fundamentals of Deep Learning Theory. _x00B_Task 1.2: Go through the Deep Learning Tutorials. _x00B_Task 1.3. Go through courses on Programming of GPUs. Execute examples listed in the courses using hardware acquired for this WFD. This task lists 2 additional 4.8.1.4. engineers who would benefit from CUDA / GPU programming training for their image processing work but are not involved with the rest of the Deep Learning WFD._x00B_Task 1.4. Go through courses on Embedded Hardware for Deep Learning. This is applicable to machine perception on a mobile platform (robotics).  \nPreparation of Deep Learning Network_x00B_Task 2.1: Evaluate the carrier video dataset to determine usability for Deep Learning training._x00B_Task 2.2: Write MATLAB code to expedite the labeling of video data._x00B_Task 2.3: Develop synthetic labeled data sets using a virtual environment that can be used to augment the real-world labeled data sets._x00B_Task 2.4: Label training data from the video set. Develop a uniform structure for enforcing the data._x00B_Task 2.5: Explore pre-trained models on publically available datasets. Investigate how to partially re-train these data with our carrier data._x00B_Tasks 2.6: Choose an appropriate DNN framework for this WFD application. _x00B_Task 2.7: Build the DNN that uses the toolsets learned and is trained / implemented using the GPU.\nImplementation of Deep Learning Neural Network_x00B_Task 3.1: Run training on the neural network and supervise progress._x00B_Task 3.2: Test the performance of the trained network on the test data set. Assess its performance. Tune the neural network as appropriate. Add complexity to the case study scenario after each success.\nDevelopment of Machine Perception System Prototype_x00B_Task 4.1: Put together prototype that can be tested using a desktop workstation and real-time camera feed_x00B_Task 4.2: Put together prototype that can be deployed onto a mobile robotic system with real-time camera feed\nReporting_x00B_Task 5.1: Write up experimental results on a Deep Learning machine vision system for the identification of aircraft and sailors on the carrier deck._x00B_Task 5.2: Write up report on the benefits and drawbacks of current Deep Learning technologies and proposed applications of Deep Learning to NAWCAD mission.  \nMaterial Costs_x00B_FY 18_x00B_NVIDIA Titan X GPU, $1,200 / card, Quantity – 2 (One for 4.8, One for 4.5 development)_x00B_NVIDIA Jetson TX1 Developer Kit, $599 / kit, Quantity – 2_x00B_Leopard Imaging TX1 Camera Kit, $379 / camera, Quantity - 2_x00B_Online Course Fees Total (for all engineers combined) - $420_x00B_Misc. Lab Consumables - $500_x00B_FY 19: Misc. Lab Consumables - $500_x00B_FY 20: Misc. Lab Consumables - $500",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2017",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Robotics",
    "Core capability identifier": "",
    "Secondary core capability": "Networks, Information Systems, and Intelligent Agents",
    "Secondary core capability identifier": "",
    "Capability gap": "Integrated Logistics Support (ILS)",
    "STO": "STO-1: Enhanced Logistical Support of Joint Assets",
    "Secondary capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "Secondary STO": "STO-2: Total Ownership Cost",
    "I&I": "Non-Combat Operations (NCO)",
    "Secondary I&I": "Non-Combat Operations (NCO)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 5",
    "Estimated total funding": "$372,400",
    "Actual total funding": "$412,958",
    "Last Updated": "04-18-2019"
  },
  {
    "Project ID": 4083,
    "Title": "R&S: Near Real Time Analytics for Platform Health Monitoring and Maintenance",
    "Topic/tracking number": "219BAR-18-051",
    "T-Code": "6.8T",
    "TPOC": "Myslinski, Thomas",
    "TPOC Email": "thomas.myslinski@navy.mil",
    "TPOC code": "6.8.4.1",
    "Secondary TPOC": "Shevach, Glenn",
    "Secondary TPOC Email": "glenn.shevach@navy.mil",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "PMA251",
    "Interested PMA(s)": "PMA260",
    "Objective": "Deliver a tool that will utilize state of the art data algorithms to assist the NAVY in data fusion and prediction of future events using “near real time” events from various DoD sources.  Upon completion this technology will have the capability to provide new or existing systems with health monitoring, user notifications, and provide future trends to help aid in maintenance decision support.",
    "Description": "Year 1 – Labor 95% + NACC interns funding will be used, Travel 0%, Material Cost 5%\nDiscovery Phase\nSystem Review and Selection Phase\nYear 2– Labor 98%, Travel 0%, Material Cost 2%\nReviewing machine Learning Techniques Phase\nReviewing Algorithms Phase\nTesting the Machine Learning with the selected system\nReviewing the Outcome and enhancing the predictability",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-6.0",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2017",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Readiness Analysis",
    "Core capability identifier": "",
    "Secondary core capability": "Automated Logistics Environment (ALE)",
    "Secondary core capability identifier": "",
    "Capability gap": "Integrated Logistics Support (ILS)",
    "STO": "STO-1: Enhanced Logistical Support of Joint Assets",
    "Secondary capability gap": "Integrated Logistics Support (ILS)",
    "Secondary STO": "STO-2: Improved Maintenance Capability",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "Fleet Support Operations (FSO)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$164,900",
    "Actual total funding": "$143,723",
    "Last Updated": "01-31-2019"
  },
  {
    "Project ID": 1153,
    "Title": "Development of Novel Knowledge-Based Space-Time Adaptive Processing (STAP) Techniques",
    "Topic/tracking number": "N05-T013",
    "T-Code": "4.5T",
    "TPOC": "Allen, Oliver",
    "TPOC Email": "oliver.allen@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Asvestas, John",
    "Secondary TPOC Email": "john.asvestas@navy.mil",
    "Portfolio": "PEO(A)-Rotary",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop innovative methods that require reduced training data support and computational loading without sacrificing STAP performance in non-stationary clutter and jamming suppression.  Techniques such as support vector machines and neural networks may be",
    "Description": "The performance of conventional STAP can be adversely affected by factors such as range-dependent clutter, jammers, jammer multipath, bandwidth effects, antenna element failure, and receiver errors.   It is desired to develop some new approaches, based on techniques such as machine learning or neural networks, to reduce the computational loading of knowledge-based STAP. *TECHNOLOGY APPROACH imported from Legacy S&T: PHASE I:  Demonstrate the use of novel knowledge-based reduced rank STAP algorithms and direct data domain STAP algorithms that can compensate for failures of individual antenna array channels.  A methodology should be established for the use of such algo",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "STTR",
    "Start date": "08-01-2005",
    "End date": "12-31-2008",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Surface Warfare (SUW)",
    "STO": "STO-1:  Maritime Surveillance and Interdiction",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Anti Surface Warfare (ASuW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$0",
    "Actual total funding": "$991,106",
    "Last Updated": "05-05-2016"
  },
  {
    "Project ID": 4294,
    "Title": "High Performance Computing and Supercomputer Training",
    "Topic/tracking number": "219WFD-TR-18-073",
    "T-Code": "4.5T",
    "TPOC": "Frech, Karen",
    "TPOC Email": "karen.frech@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Velazquez, Esov",
    "Secondary TPOC Email": "esov.velazquez@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "PMA263",
    "Objective": "The objective is to obtain hands on training for NAWC 4.5.14 computer scientists and engineers on the DoD High Performance Computing systems to improve overall workforce development in the area of supercomputing and parallel processing. Knowledge of how to write scripts and programs to execute anti-submarine warfare (ASW) modeling and simulation tools utilizing high performance systems is needed to improve deep machine learning, machine vision, sensor fusion, and artificial intelligence algorithms.",
    "Description": "September 2018, Training at the Wright Patterson AFB, Dayton, OH for 1 week (6 employees)\nLabor Costs: 6 employees – see details by grade level in cost proposal\nTravel Costs: 6 nights lodging, airfare, meals, and rental car for 4 employees estimated: 12K\n\nJune 2018, Training at Pt. Hueneme, CA or 2 days  (1 employee able to go)\nLabor Costs: 1 employees – see details by grade level in cost proposal",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA263",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2017",
    "End date": "09-30-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Sensor and Data Fusion",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-4: Computing, Processing, and Architectures",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "Command, Control, and Communications (CCC)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$62,440",
    "Actual total funding": "$61,439",
    "Last Updated": "10-11-2018"
  },
  {
    "Project ID": 4094,
    "Title": "ADV TECH: Collaborative Autonomous Route Planning (CARP)",
    "Topic/tracking number": "219BAR-18-057",
    "T-Code": "4.5T",
    "TPOC": "Frech, Karen",
    "TPOC Email": "karen.frech@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Rea, Charles",
    "Secondary TPOC Email": "charles.rea@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "PMA234, PMA262, PMA263, PMA281 (UAS), PMA281 (Weapons)",
    "Objective": "Develop and deliver autonomous route planning algorithms that will provide improved collaborative and shared situational awareness for a swarm of cooperating UAVs improving search effectiveness, autonomy capability, counter UAV technology, and artificial intelligence in contested electromagnetic environments. The deliverables from this research include routing and planning algorithms, documentation, papers, presentations, and demonstration utilizing the DARPA Collaborative Operations in Denied Environments (CODE) technology. This research will enable an operator to effectively control multiple UAVs (instead of currently only one) without increasing operator workload. The benefit of multiple UAVs working in coordination and synchronization will provide collaborative autonomy, added intelligence gathering, improved situational awareness, quicker response, greater fighting power, and a warfighter advantage",
    "Description": "Year 1: (2.35 MY, $15K Travel, $37.3K Material) Develop and integrate routing algorithms on DARPA CODE hardware/software environment. \nTask 1.1: (0.10 MY) Acquire hardware and software needed for the development and integration effort with DARPA Code. Learn the SLAMEM interface. \nTask 1.2: (0.40 MY) Establish metrics, develop metrics algorithms for processing SLAMEM output performance data and quantify base-line performance. Leverage metrics developed within the SLAMEM metrics toolbox.\nTask 1.3: (0.3 MY) Create multiple routing scenarios consisting of multiple UAVs and exclusion zones in SLAMEM.  Continue to develop SLAMEM modeling and simulation upgrades to support research effort.\nTask 1.4: (0.75 MY) Develop route planning algorithms. Implement a route planner using the A* algorithm. Test using SLAMEM running the multiple routing scenarios and optimize performance by examining metrics.\nTask 1.5: (0.50 MY) Develop coordinated route planning initially by developing situational awareness algorithm and embed into DARPA Code link and DDS backbone.\nTask 1.6:  (0.25 MY) Establish Autonomy Lab with camera equipment.  Establish baseline study cases for temporal and spatial alignment with quad copter drones for electronic maneuvering functionality studies.\nTask 1.7: (0.05 MY, $15K Travel) Compute metrics for routes, time to detect, number of detections, number of tracks, time UAVs were detected and tracked.  Compare various route plans with metrics.  Determine optimization recommendations.  Prepare paper for publication and/or showcase demonstration of capability with 3rd party application hosted on DARPA CODE embedded system in collaboration with ongoing DARPA flight tests.\n\nYear 2: (2.70 MY, $30K Travel, $5k Material) Build, test, and demonstrate collaborative autonomous routing plans integrated with DARPA CODE embedded systems, establish mechanisms for positional and situational awareness for electronic maneuvering. Keep pace with DARPA CODE developments by obtaining latest toolkit design and interfaces and integrate NAWC developed algorithms.\nTask 2.1: (0.20 MY) Improve sensor model fidelity in SLAMEM to provide realism for red/blue sensor functionality.\nTask 2.2: (0.8 MY) Prepare and enable target tracking algorithms in conjunction with route planning using data fusion technology in SLAMEM. Compare search and target tracking performance with metrics developed using high fidelity models.\nTask 2.3: (0.5 MY) Enhance autonomous route planner technology to incorporate uncertainty in target location.  Establish metrics for performance with uncertainty.\nTask 2.4: (1.0 MY) Demonstrate electronic maneuvering concept, adapt high speed camera technology feedback look to drones for situational awareness, build and demonstrate swarm functionality with spatial alignment.\nTask 2.5: (0.1 MY) Conduct Monte Carlo studies to determine how performance scales with additional UAVs.\nTask 2.6: (0.1 MY, $30K Travel) Prepare paper for publication and/or showcase demonstration of capability with 3rd party application hosted on DARPA CODE embedded system in collaboration with ongoing DARPA flight tests (2 flight test events per year in Arizona).  \n\n\nFY 18 Material Costs (32.3K) Break Out:\nLab Fee – 5K\nHardware – 12K\nLinux PC w/  >=8GB RAM and >=2GHz processor -- 3K\n3 Kontron KTQM87 Cards – 4K\nCODE Hardware-In-The-Loop hardware -- 1K\nUse of RQ23 3 Tigersharks – 0K\n3 Piccolo Autopilots – 4K\nSoftware -- 20.3K\nJHU Whiteforce Controller (possibly)\nRaytheon SDK – 0K\nRTI DDS Micro License  -- 20K\nEnterprise Architect License  -- 0.2K\nLinux Fedora w/ the Following Software -- 0.1K\npython 2.7\nRaytheon Simulation Environment\nJava version 1.7\nRTI DDS Micro 2.9\n\nFY 19 Material Cost (5K) Break Out:\nLab Fee – 5K",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA262",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2017",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Electronic Warfare",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-1: Command and Control",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "Information Operations (IO)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 4",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$953,300",
    "Actual total funding": "$957,200",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 4027,
    "Title": "ADV TECH: User Interface Strategies for Human-Machine Team Training in a Simulated Swarm Task",
    "Topic/tracking number": "219BAR-18-036",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Guest, Mike",
    "TPOC Email": "michael.guest@navy.mil",
    "TPOC code": "4.6.5.2",
    "Secondary TPOC": "Hart, Kyle",
    "Secondary TPOC Email": "kyle.m.hart@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "This project will compare the impact of multiple innovative display strategies on human-machine team training within a simulated multi-unmanned system scenario (i.e., swarm).  Participants will be trained to coordinate with a team of adaptive, semi-autonomous systems to perform an intelligence, surveillance and reconnaissance (ISR) mission.  Results will inform ongoing efforts to define user interface requirements for operator control of multiple, unmanned systems, as well as empirical evaluation of state diagrams and task-based interfaces to facilitate human-machine team training for swarm-based tasks.",
    "Description": "Very detailed task breakdown and cost descriptions are provided in the attached proposal package that was approved by the ERB.",
    "Primary transition type": "I - Basic research exempt",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2017",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Human Systems Design and Decision Support",
    "Core capability identifier": "",
    "Secondary core capability": "Warfighter Protection, Performance, and Survivability",
    "Secondary core capability identifier": "",
    "Capability gap": "Naval Warrior Performance (NWP)",
    "STO": "STO-2: Human Systems Design and Decision Support",
    "Secondary capability gap": "Naval Warrior Performance (NWP)",
    "Secondary STO": "STO-1: Training and Education",
    "I&I": "Expeditionary Warfare (EXW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$280,400",
    "Actual total funding": "$236,378",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 3939,
    "Title": "R&S: Applying Machine Learning Concepts for Accurate Mechanical Diagnostic and Prognostic Fault Isolation",
    "Topic/tracking number": "219BAR-18-010",
    "T-Code": "4.4T",
    "TPOC": "Jones, Allen",
    "TPOC Email": "allen.jones2@navy.mil",
    "TPOC code": "4.4.2.2",
    "Secondary TPOC": "Hines, Jason",
    "Secondary TPOC Email": "jason.hines1@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Recent success evaluating H-1Y/Z vibration data to identify and isolate impending gearbox failures presents an opportunity to evaluate machine learning concepts for use in diagnostic and prognostic frameworks.  Current approaches to evaluate aircraft data are labor intensive, and the complexity of the system data prevents direct deployment of solutions to the fleet.  The objective of this research effort is to evaluate the effectiveness of various machine-learning models and frameworks against known failure datasets to (1) identify anomalies, (2) properly classify component failure, and (3) evaluate remaining useful-life approaches to present prognostic capabilities.",
    "Description": "1.  FY18 (Year 1)\nAIR 4.4.2.2 Labor: \t0.5 WY (3 persons); \nAIR 4.4.2.2 Travel:\t$3k\nAIR 4.4.2.2 Material:\t$0k\nNOTE:  See FY18 Cost Proposal for detailed cost breakdowns as well as respective justifications\n\nTask 1:  Establish the Machine Learning Dataset and Finalize Training Data vs Test Data\nMachine-learning approaches require adequate training data to enable appropriate and accurate model development.  This first task addresses the requirement to identify all appropriate data for this effort, starting with the known fault data from H-1Y/Z removals in the past few years.  This effort will provide funds to score the data appropriately, extract all meaningful data into relevant table structures to enable machine learning, and evaluate model performance by dividing the complete data set into a training and test set.  The dataset will include, at a minimum, maintenance action forms, Naval Aviation Flight Records (NAVFLIR records), smart aircraft data, and system health assessments (as derived from EI reports on known removals).\n\nTask 2:  Develop the SOPs for Machine-Learning Model Development and Evaluation\nConcurrent with the collection, extraction, and storing of the relevant underlying data to train the models will be the task of developing the framework by which analyses will be conducted when  evaluating diagnostic and prognostic capability.  Data-science CONOPS and frameworks are abundant in literature today, but all are not relevant to developing a framework to identify diagnostic and prognostic capability.  This task will develop the NAVAIR SOP for developing, evaluating, and deploying machine-learning algorithms for diagnostics and prognostics.  \n\n2.  FY19 (Year 2)\nAIR 4.4.2.2 Labor: \t0.5 WY (3 persons); \nAIR 4.4.2.2 Travel:\t$4k\nAIR 4.4.2.2 Material:\t$4k\nNOTE:  See FY19 Cost Proposal for detailed cost breakdowns as well as respective justifications\n\nTask  1:  Model Development and Evaluation\nWith data in-hand and an SOP developed, work will begin in earnest during the second year to evaluate available machine-learning algorithms against the datasets within the NAVAIR infrastructure.  Models to evaluate will include linear and logistic regression, principal component analysis, decision trees, random forests, gradient boosting, and various neural-network architectures to evaluate the best performing models for the three specific goals of this project:  (1) anomaly identification, (2) fault classification, and (3) Remaining Useful Life (RUL) prediction.  \n\nFor those algorithms initially deemed viable, attempts will be made to tailor the model as best as possible (without overfitting) to the test and training data, identifying metrics for false alarm and missed detection rates.  Results from this effort will be written into a final paper for potential publications and presentations. \n\nTask 2:  Update to SOPs to Production ML Models\nFollowing the completion of the research effort, the SOP will be updated to reflect lessons learned and define the generalized approaches best suited to the different analysis tasks for diagnostics and prognostics.  This SOP will become the guiding force in AIR 4.4.2.2’s approach to evaluation of new and existing algorithms to predict component failure, and should be applicable across multiple TMS.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.4",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-02-2017",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "State-Based Management of Dynamic Components",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-2: Total Ownership Cost",
    "Secondary capability gap": "Integrated Logistics Support (ILS)",
    "Secondary STO": "STO-2: Improved Maintenance Capability",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$154,200",
    "Actual total funding": "$154,199",
    "Last Updated": "01-31-2019"
  },
  {
    "Project ID": 3998,
    "Title": "MISS CAP: Application of data fusion and machine learning techniques to underwater laser imaging systems",
    "Topic/tracking number": "219BAR-18-019",
    "T-Code": "4.5T",
    "TPOC": "Alley, Derek",
    "TPOC Email": "derek.m.alley@navy.mil",
    "TPOC code": "4.5.6",
    "Secondary TPOC": "Rickard, Kristina",
    "Secondary TPOC Email": "kristina.rickard@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Investigate the utility of data fusion and machine learning techniques to process and extract information from multiple sensors, focusing on data collected with state of the art underwater laser imaging systems. This goal will be accomplished through a collaborative effort between the Sensor Fusion Branch (4.5.5.3) and the EO and Special Mission Sensors Division (4.5.6). The project deliverables will include processing schemes that fuse together data from multiple sensors and/or extract image details via machine learning techniques to enhance the identification of underwater threats.",
    "Description": "FY18 Tasks: (Labor: $81.62k, Material: $25.5k, Travel: $5k)\nCollect and prepare point cloud data from laboratory underwater LIDAR system: Point cloud data of a mine replica from an in-house LIDAR system has been generated for multiple water conditions and both short pulse and modulated pulse illumination source types. This data is available and will be pre-processed to prepare for insertion into machine learning algorithms.\nLabor: $16.27k (12% MY) Derek Alley, Linda Mullen\nInvestigate machine learning techniques and determine the ones most applicable for underwater LIDAR: As a follow up to a FY17 machine learning MATLAB course, a more thorough investigation into machine learning algorithms will be done to narrow down which techniques are most appropriate for underwater LIDAR and object detection/identification.\nLabor: $28.6k (21% MY) Derek Alley, Kristina Rickard, Linda Mullen\nMaterial: $1k\nApply machine learning techniques to point cloud data collected from in-house underwater LIDAR system: Machine learning algorithms will be realized in software and applied to LIDAR data sets, leveraging the image processing and machine learning MATLAB toolboxes.\nLabor: $28.6k (21% MY) Derek Alley, Kristina Rickard\nMaterial: $16.5k\nPrepare joint publications and progress reports and present results at SPIE DSS Conference in April 2018\nLabor: $8.15k (6% MY) Derek Alley, Kristina Rickard\nTravel: $5k\nLab Fee: Calibration and maintenance of sensitive laboratory equipment\nMaterial: $8k\n\nFY19 Tasks: Labor: ($81.91k, Material: $17.75k, Travel: $7.5k)\nPrepare and format field test data from multiple sensor types for data fusion: Image and range data from multiple sensor types (lidar, sonar, camera) will be available from the FY18 efforts of a NISE 219 transition project. The data will contain information about real inert mines from the range at SPAWAR (San Diego). This data will be pre-processed to prepare it for insertion into data fusion algorithms. \nLabor: $16.37k (12% MY) Derek Alley, Linda Mullen\nInvestigate sensor fusion techniques applicable to object detection and identification: A more thorough investigation into data fusion techniques will be done to narrow down which techniques will work best to combine LIDAR, side scan SONAR, passive camera, and navigation data to extract addition information about a target that will enhance detection and identification.\nLabor: $28.67k (21% MY) Derek Alley, Kristina Rickard, Linda Mullen\nMaterial: $1k\nApply sensor fusion techniques to field test data: Chosen sensor fusion techniques will be realized in software, leveraging the computer vision, image processing, and parallel processing toolboxes in MATLAB.\nLabor: $28.67k (21% MY) Derek Alley, Kristina Rickard\nMaterial: $8.75k\nPrepare joint publications and progress reports and present results at SPIE DSS and ISIF International Conference for Information Fusion.\nLabor: $8.2k (6% MY) Derek Alley, Kristina Rickard\nTravel: $7.5k\nLab Fee: Calibration and maintenance of sensitive laboratory equipment\nMaterial: $8k\n\nFY20 Tasks: Labor: ($82.21k, Material: $25k, Travel: $7.5k)\nInvestigate current applications of multistatics: The role of multistatics in SONAR and RADAR will be investigated to look for applicable techniques for underwater LIDAR applications.\nLabor: $28.78k (21% MY) Derek Alley, Kristina Rickard, Linda Mullen\nMaterial: $1k\nDesign and execute laboratory test with multistatic LIDAR: Findings from previous task will influence the design of an in-house water tank test in building 2185. This test will be used to exploit the advantages of multistatics as it applies to underwater LIDAR.\nLabor:  $16.44k (12% MY) Derek Alley, Kristina Rickard, Linda Mullen\nMaterial: $10k\nFuse and process data collected with the multistatic sensor system: Techniques learned from the previous two years of the project will be leveraged to process the data from the tank test and extract more information than could be achieved without a multistatic system architecture.\nLabor: $28.78k (21% MY) Derek Alley, Kristina Rickard\nMaterial: $6k\nPrepare joint publications and progress reports and present results at SPIE DSS and ISIF International Conference for Information Fusion:\nLabor: $8.21k (6% MY) Derek Alley, Kristina Rickard\nTravel: $7.5k\nLab Fee: Calibration and maintenance of sensitive laboratory equipment\nMaterial: $8k",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-02-2017",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Laser Systems for Degraded Visual Environments",
    "Core capability identifier": "",
    "Secondary core capability": "Sensor and Data Fusion",
    "Secondary core capability identifier": "",
    "Capability gap": "Under Sea Warfare (USW)",
    "STO": "STO-1:  Environmental Sensing, Assimilation and Tactical Decision Aids",
    "Secondary capability gap": "Force Protection (FP)",
    "Secondary STO": "STO-2:  Mine and IED Detection and Neutralization",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "Naval Special Warfare (NSW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$334,000",
    "Actual total funding": "$339,113",
    "Last Updated": "04-16-2019"
  },
  {
    "Project ID": 3868,
    "Title": "Quantum Computing Training and Optimization",
    "Topic/tracking number": "219WFD-TR-18-014",
    "T-Code": "4.5T",
    "TPOC": "Mullen, Regina",
    "TPOC Email": "regina.mullen@navy.mil",
    "TPOC code": "4.5.18",
    "Secondary TPOC": "Harris, Darius",
    "Secondary TPOC Email": "darius.harris@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Gain a solid understanding of the different types of potential quantum computing technologies with an emphasis on quantum annealing, the D-Wave architecture, and its programming model. Our ultimate goal is be able to use the D-Wave machine to solve problems of relevant interest to the Navy such as optimization problems, machine learning, traveling salesman problems, etc., focusing on problems that can exploit the potential speedup of a quantum computer.",
    "Description": "D-Wave’s formal training:\n\nNovember  2017, Training at Pax River (20 employees)\nLabor Costs: 15 employees – see details by grade level in cost proposal\nMaterial Cost: 40K (D-Wave cost for training)\n                          1k for renting the meeting room\nJanuary  2018, Training at Pax River for 3 days (20 employees)\nLabor Costs: 15 employees – see details by grade level in cost proposal\n3 k for renting the meeting room\nJuly 2018, Training at Pax River for 3 days (20 employees)\nLabor Costs: 15 employees – see details by grade level in cost proposal\n2k for renting the meeting room\n\nApplication: \nFY18:  1) Using the fleet mission planning tool, field sonar performance data will be generated for a simple field of 3x3 sensors. This data will be used to find the optimum probability of detecting a target using brute force tools. \n2) We will begin using a D-Wave simulator to develop an algorithm that finds the optimum configuration of sensors that maximizes the probability of target detection for a 3x3 sensor field. \n\nFY19: During FY19, we will extend the algorithm developed in FY18 to a field mission planning problem involving a multitude of sensors (4x8 field) and compare those results to the classical algorithm output.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.5",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2017",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Electronic Warfare",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-4: Computing, Processing, and Architectures",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 2",
    "Estimated total funding": "$450,900",
    "Actual total funding": "$428,335",
    "Last Updated": "10-12-2018"
  },
  {
    "Project ID": 4007,
    "Title": "ADV TECH: Machine Learning Techniques for Real Time Advanced Signal Processing",
    "Topic/tracking number": "219BAR-18-023",
    "T-Code": "5.2T",
    "TPOC": "Itschner, Stephen",
    "TPOC Email": "stephen.itschner@navy.mil",
    "TPOC code": "5.2.4.2",
    "Secondary TPOC": "Itschner, Stephen",
    "Secondary TPOC Email": "stephen.itschner@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Using machine learning and neural networks, it should be possible to design a system which enables advanced signal processing techniques to operate on radar data during real time test events. Literature suggests that neural networks are capable of overcoming data scaling challenges posed by computationally complex algorithms, because they yield linear run time complexity as opposed to super-linear, which is the current state of the art. It further suggests that numerous man hours may be saved and data quality improved by automating the custom filter engineering required by the advanced signal processing methods. Background: The ADAMS system and the Importance of Real Time Data: The Advanced Dynamic Aircraft Measurement System (ADAMS) is DONs only open-air dynamic Radar Cross Section (RCS) measurement instrumentation radar. It supports all military services as well as other government agencies, and is designated as core Test and Evaluation infrastructure necessary to support the DoD acquisition process. A key feature of this system is real-time spectrum returns and RCS quick look data, which ADAMS customers use as feedback to adjust their testing while the platform is still flying. Because of real time data products, customers can make an informed go-no go decision to continue flight or to adjust their test plan, dramatically increasing test efficiency and reducing cost. Without this capability, customers would be obliged to wait until the final data is delivered before determining mission success or failure, and could not adjust their test plans to investigate RCS phenomenon adaptively.  ADAMS final data is delivered after painstaking hand analysis by ADAMS analysts, with a ratio of 4 hours processing required for every hour of flight testing.",
    "Description": "Year 1:\nResearch and purchase the latest equipment required for efficient neural network development, as mentioned in the technical approach (“A Note on Applications and Typical Hardware”). Funding of either product would allow the project to move forward, but production will be greatly enhanced if both are facilitated\nMachine learning PC, preconfigured system for desk-based development: $15k\nRack mounted enterprise-level GPU cluster, for test of deployment in ADAMS environment: $120k\nCollect a baseline unclassified dataset to constitute real world training and testing data (ongoing throughout both years if/when ADAMS frequency bands become capable of measuring such data)\nAdapt the MIT simulation and processing code to create a large controlled simulated dataset\nBuild a prototype neural network architecture for both computational complexity improvement and filter design automation\nVerify that the prototype architecture performs as expected on the simulated dataset\nYear 2:\nModify the prototype neural networks based on performance\nEvaluate the prototype when run on data actually collected by ADAMS\nCollaborate with full ADAMS team to verify that prototype meets the stated objectives\nGenerate derivative literature decoupled from the specifics of the ADAMS system and its operation for submission to academic journal",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-5.2",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-09-2017",
    "End date": "09-27-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Signature Measurements",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Force Protection (FP)",
    "STO": "STO-1:  Platform Survivability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$189,100",
    "Actual total funding": "$242,205",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 4192,
    "Title": "Ship sensor Fusion for Target Identification and Classification (SIFTIC)",
    "Topic/tracking number": "N172-108",
    "T-Code": "4.5T",
    "TPOC": "Sutton, Lisa",
    "TPOC Email": "lisa.f.sutton@navy.mil",
    "TPOC code": "471700D",
    "Secondary TPOC": "Allen, Oliver",
    "Secondary TPOC Email": "oliver.allen@navy.mil",
    "Portfolio": "PEO(A)-Rotary",
    "Primary supporting PMA": "PMA299 (Rotary)",
    "Interested PMA(s)": "PMA280",
    "Objective": "Develop an innovative approach that exploits new methodology in machine learning and modern mobile computing devices to fuse information obtained from different sensor types in order to achieve dramatic improvement in target classification and identification capability for space, weight and power (SWaP) constrained platforms.",
    "Description": "The capability to combine the salient feature information from the different sensors to\nget improved target classification, and possibly identification, of the ships is needed. Recent advances in machine learning can be explored to discover and to fuse the different feature information inherent within the different sensor types while advances mobile computing processors enables these machine learning approaches to work efficiently and robustly in real-time.",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "10-11-2017",
    "End date": "02-02-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Radar and Antenna Systems Capability",
    "Secondary core capability identifier": "",
    "Capability gap": "Surface Warfare (SUW)",
    "STO": "STO-1:  Maritime Surveillance and Interdiction",
    "Secondary capability gap": "Force Protection (FP)",
    "Secondary STO": "",
    "I&I": "Anti Surface Warfare (ASuW)",
    "Secondary I&I": "",
    "NAWC lab": "WD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "$1,453,996",
    "Last Updated": "03-11-2019"
  },
  {
    "Project ID": 4185,
    "Title": "University of Tulsa PhD in Computer Science Dissertation Research Proposal",
    "Topic/tracking number": "",
    "T-Code": "5.1T",
    "TPOC": "Ashworth, James",
    "TPOC Email": "james.n.ashworth@navy.mil",
    "TPOC code": "5.1.12.2",
    "Secondary TPOC": "Hastings, Brian",
    "Secondary TPOC Email": "brain.hastings@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "To obtain a Doctor of Philosophy (PhD) in COmputer Science with a  focus on Cyber Security and Swarm based Artificial Intelligence from the University of Tulsa.  \n\nSwarm based intelligent platforms are the next big innovation for most modern technologies.  With most wifi networks now adopting self regulating mesh networks, modern cars planning cross communication by 2025, and military grade drone swarms being designed for use in 2030, being able to develop and demonstrate both cyber attacks and protections is a key area of research.  As such, it is imperative to develop internal technical competence and expertise in this research area.",
    "Description": "FY18 Tasks:\nCollaborate with industry and agency partners to determine applicable existing techniques and research.  \nLeverage existing proposals on swarm communication to determine common vunerabilites and exploits.  \n\nFY19 Tasks:\nDevelop proof of concept attacks using discovered exploits, and design data link network impervious to vunerabilities.  \n\nFY20 Tasks:\nDemonstate new data link communication impervious to previous vunerabilities.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Navy",
    "Funding source": "Discovery & Invention (D&I)",
    "Start date": "01-08-2018",
    "End date": "12-21-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Experimentation as Component of T&E Strategies",
    "Core capability identifier": "",
    "Secondary core capability": "UAS Testing",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-5: Cyber Defense- Information Assurance (IA) and Network Protection",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Information Operations (IO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$150,000",
    "Actual total funding": "",
    "Last Updated": "05-11-2018"
  },
  {
    "Project ID": 2222,
    "Title": "Use of Layered Supervised and Unsupervised Machine Learning Algorithms for Improved Detection and Classification",
    "Topic/tracking number": "219BAR-14-021",
    "T-Code": "4.5T",
    "TPOC": "Baker, Justin",
    "TPOC Email": "justin.d.baker@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Bryner, Edward",
    "Secondary TPOC Email": "edward.bryner@navy.mil",
    "Portfolio": "PEO(A)-ASW",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Improve the ability of the Multistatic Active Coherent (MAC) sonar system to automatically distinguish submarines from non-submarines.",
    "Description": "Active sonar looks for sound reflected off of submarines. In this research it is proposed to separate sound echoes as submarine-like and non-submarine-like by using both supervised and unsupervised machine learning algorithms. This effort will provide the ability to automatically and efficiently distinguish submarines from non-submarines through the use of a human-independent classifier.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA264",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2013",
    "End date": "09-30-2015",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "Airborne Anti-Submarine Warfare (ASW)",
    "Core capability identifier": "",
    "Secondary core capability": "Airborne Anti-Submarine Warfare (ASW)",
    "Secondary core capability identifier": "",
    "Capability gap": "Under Sea Warfare (USW)",
    "STO": "STO-2:  Wide Area Search and Detection",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Anti-Submarine Warfare (ASW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$134,600",
    "Actual total funding": "$126,251",
    "Last Updated": "12-06-2017"
  },
  {
    "Project ID": 4224,
    "Title": "New Hardware for the Radio Frequency and Antenna Demonstration and Instruction for Advancing Technology Education (RADIATE) and Aviation Electronics and Sensors Internship Program (AESIP) Summer STEM Programs",
    "Topic/tracking number": "",
    "T-Code": "4.5T",
    "TPOC": "Hauck, Katie",
    "TPOC Email": "katie.hauck@navy.mil",
    "TPOC code": "4.5.5",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "To put together RF hardware (including a Radar, Power Sensor, and RF source) for use by STEM students participating in the AESIP and RADIATE summer internships sponsored by AIR 4.5.",
    "Description": "As part of the AESIP and RADIATE Summer STEM projects, the students will be introduced to RF concepts including antennas and Radar sensors. These courses provide a hands-on learning environment utilizing custom designed hardware which operates in the 2.4 GHz ISM (WiFi) band.\n\nThe purpose of this project is  to implement new hardware which will afford the students the opportunity to conduct hands on experiments, including designing and executing their own Radar experiments (as part of RADIATE). The new hardware will correct known issues as well as obsolesce issues with the hardware used in previous years and  be simpler to operate.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE WFD",
    "Start date": "01-19-2018",
    "End date": "09-28-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Radar and Antenna Systems Capability",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Non-Naval Aviation",
    "STO": "Non-Naval Aviation",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$8,500",
    "Actual total funding": "$8,500",
    "Last Updated": "01-05-2018"
  },
  {
    "Project ID": 4516,
    "Title": "ADV TECH: Autonomous Systems/AI Test & Evaluation and Verification and Validation (ATEVV)",
    "Topic/tracking number": "219WFD-SG-18-046",
    "T-Code": "5.0T",
    "TPOC": "Sappington, Jeffrey",
    "TPOC Email": "jeff.sappington@navy.mil",
    "TPOC code": "AIR 5.1.12",
    "Secondary TPOC": "Frech, Karen",
    "Secondary TPOC Email": "karen.frech@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The overall objective of this effort is for NAWC to establish the tools, methods and\ncompetencies necessary for Autonomy Test, Evaluation, Verification and Validation (ATEVV). Autonomous systems and machine learning algorithm-enhanced systems, for example UAS swarms and cognitive radar, will be eventually forthcoming in programs of record, and the test competencies need to be ready and competent to test these new systems.",
    "Description": "Specific efforts are defined in attached quads and spend plan.   It is intended to manage all of these efforts under this “roll up” proposal, giving the flexibility to maximize overall execution.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-5.0",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "05-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Strike Operations (STK)",
    "Secondary STO": "STO-4:  Airborne Electronic Attack",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "Command, Control, and Communications (CCC)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$180,900",
    "Actual total funding": "$550,231",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 4672,
    "Title": "Develop and Apply Artificial Intelligence and Machine Learning Techniques for Next-Generation Mission Planning",
    "Topic/tracking number": "N181-018",
    "T-Code": "4.9T",
    "TPOC": "Ramsay, BJ",
    "TPOC Email": "bryan.ramsay@navy.mil",
    "TPOC code": "PMA281",
    "Secondary TPOC": "Nagy, Bruce",
    "Secondary TPOC Email": "bruce.nagy@navy.mil",
    "Portfolio": "PEO(U&W)-Weapons",
    "Primary supporting PMA": "PMA281 (Weapons)",
    "Interested PMA(s)": "PMA201, PMA281 (UAS)",
    "Objective": "Develop an approach to exploit artificial intelligence (AI) and machine learning (ML) techniques (e.g., deep learning [DL]) to improve mission planning capability, and to provide autonomous and dynamic mission and strike planning capabilities in support of manned and unmanned vehicles and weapon systems.",
    "Description": "AI, and various versions of ML, have been applied to many fields such as cancer research, complex games like Jeopardy, Poker, and GO, and more recently heart attack prediction with great success [Ref 8].  These techniques have begun to be investigated and researched related to the topic of mission planning, as discussed at a recent conference, Tactical Advancement for the Next Generation (TANG).  This SBIR topic seeks to demonstrate how AI and ML can be applied to multi-vehicle, multi-domain mission planning.  Mission and strike planning are complex processes, integrating specific performance characteristics for each platform into a comprehensive mission.  The Joint Mission Planning System (JMPS), a software application, consists of a basic framework and unique mission planning environment software packages for each platform.  To fully appreciate the overall complexity, a basic understanding of the planning (operational and tactical) process workflow as well as the actual human involvement in the mission planning process is necessary.  The result of this project will provide the foundation of how to train the computer and exploit AI capabilities to generate automatic mission and strike plans for multi-vehicle, multi domain scenarios involving manned and unmanned systems.  The developer should also consider how to deal with different levels of security classifications in ingestion of data for training and subsequently in generating mission and strike plans, to include shared plan representation, adaptive coordination and interoperability.\n\n Note: To understand the JMPS functionality and appreciate the complexity of the JMPS software and to support the objective of the topic, Government will provide companies awarded a Phase I contract a current version of the software and source code with embedded help files and JMPS Concept of Operation (CONOPS) and Use Cases document.\n\n Work produced in Phase II may become classified.  Note: The prospective contractor(s) must be U.S. Owned and Operated with no Foreign Influence as defined by DOD 5220.22-M, National Industrial Security Program Operating Manual, unless acceptable mitigating procedures can and have been implemented and approved by the Defense Security Service (DSS).  The selected contractor and/or subcontractor must be able to acquire and maintain a secret level facility and Personnel Security Clearances, in order to perform on advanced phases of this contract as set forth by DSS and NAVAIR in order to gain access to classified information pertaining to the national defense of the United States and its allies; this will be an inherent requirement.  The selected company will be required to safeguard classified material IAW DoD 5220.22-M during the advance phases of this contract.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "06-04-2018",
    "End date": "12-10-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-3: Collaborative Unmanned Strike Capability",
    "Secondary capability gap": "Enterprise and Platform Enablers (EPE)",
    "Secondary STO": "STO-4: Weapon Enablers",
    "I&I": "Strike Warfare (STW)",
    "Secondary I&I": "Command, Control, and Communications (CCC)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "$499,853",
    "Last Updated": "10-01-2018"
  },
  {
    "Project ID": 4674,
    "Title": "Adaptive, individualized training assessment capability (AITAC)",
    "Topic/tracking number": "OSD11-CR1",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Priest, Heather",
    "TPOC Email": "heather.priest@navy.mil",
    "TPOC code": 4.6,
    "Secondary TPOC": "Astwood, Randy",
    "Secondary TPOC Email": "randy.astwood@navy.mil",
    "Portfolio": "AIR-1.0",
    "Primary supporting PMA": "PMA205",
    "Interested PMA(s)": "",
    "Objective": "The objective of this topic is to develop and implement a technique for building individualized representations of trainee performance that can be used to assess current performance and to forecast future training needs.",
    "Description": "Increasingly, instructional system developers are focusing their efforts on developing individualizable and adaptable training capabilities [1]. The benefits of providing this type of instruction are well documented [2] and are a direct result of the fact that individuals learn in different ways [3]. At the core of any adaptive training system are representations of the trainee, in terms of their knowledge, skills and abilities [4]. These representations are used by the instructional system to assess current trainee performance and to forecast the timing and content of future instructional remediations. A key challenge with building truly individualizable and adaptable training systems rests in the manner in which these trainee representations are developed. Typically, these representations are created using pre-defined performance measures, bounded by static parameters. Once a boundary is passed, a standard intervention is applied until the next iteration of performance assessment shows a return to within-parameter conditions.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "06-05-2018",
    "End date": "12-02-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "HPM and Human Performance Assessment (HPA)",
    "Core capability identifier": "",
    "Secondary core capability": "Human Systems Design and Decision Support",
    "Secondary core capability identifier": "",
    "Capability gap": "Naval Warrior Performance (NWP)",
    "STO": "STO-1: Training and Education",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$0",
    "Actual total funding": "$375,000",
    "Last Updated": "12-04-2018"
  },
  {
    "Project ID": 4673,
    "Title": "Maritime Target Automatic Target Recognition from Inverse Synthetic Aperture Radar (ISAR) Utilizing Machine Learning",
    "Topic/tracking number": "N181-029",
    "T-Code": "4.7T",
    "TPOC": "Sutton, Bob",
    "TPOC Email": "robert.sutton@navy.mil",
    "TPOC code": 4.7,
    "Secondary TPOC": "Decker, Dan",
    "Secondary TPOC Email": "daniel.l.decker@navy.mil",
    "Portfolio": "PEO(U&W)-Weapons",
    "Primary supporting PMA": "PMA280",
    "Interested PMA(s)": "PMA290",
    "Objective": "Develop an innovative automatic target recognition (ATR) system that leverages state-of-the-art machine learning technology to automatically find and extract ships salient features from their inverse synthetic aperture radar (ISAR) images for high-speed weapons applications.",
    "Description": "Development of machine learning target recognition algorithms in minimal hardware with synthetic imagery generation to develop high speed, high confidence target identification to the ship class level. Using intelligence based target information, simulated ISAR imagery representative of US sensor systems is generated along with a tool for training deep machine learning neural networks and implementing the algorithm into missile or avionics processors for specific target identification.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "06-07-2018",
    "End date": "12-08-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Weapon Seekers and Sensors-RF, EO, and IR Signal Processing",
    "Core capability identifier": "",
    "Secondary core capability": "Weapon Navigation, Control, and System Simulation",
    "Secondary core capability identifier": "",
    "Capability gap": "Surface Warfare (SUW)",
    "STO": "STO-1:  Maritime Surveillance and Interdiction",
    "Secondary capability gap": "Strike Operations (STK)",
    "Secondary STO": "STO-1:  Responsive Engagement",
    "I&I": "Anti Surface Warfare (ASuW)",
    "Secondary I&I": "N/A",
    "NAWC lab": "WD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 4",
    "Estimated TRL at completion": "TRL 5",
    "Estimated total funding": "$0",
    "Actual total funding": "$499,949",
    "Last Updated": "10-01-2018"
  },
  {
    "Project ID": 2340,
    "Title": "PhD in Computer Engineering",
    "Topic/tracking number": "219WFD-HE-14-029",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Nguyen, Tam",
    "TPOC Email": "tam.d.nguyen@navy.mil",
    "TPOC code": "4.6.8.5",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Pursue a Ph.D. in Computer Engineering with a focus in Artificial Intelligence (AI).",
    "Description": "The Ph.D. in Computer Engineering curriculum will provided advanced skills and lay the groundwork for the implementation of techniques in Modeling and Simulation, Artificial Intelligence, Machine Learning, and Natural Language Processing for the candidate. With these foundations, the candidate can apply AI techniques to computer based modeling and simulation and utilize the machine learning algorithms to develop a model that is capable of predicting an accurate outcome for training scenarios. Throughout the Ph.D. curriculum at UCF, the candidate will learn the state-of-the-art in AI technology and acquire significant knowledge and skill sets in advanced research, machine learning, and human performance system trainings. The acquired knowledge will help the candidate to contribute and meet the challenges of developing high fidelity trainers for our warfighters.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-18-2014",
    "End date": "05-01-2015",
    "Project status": "Canceled",
    "Reason for cancellation": "",
    "Core capability": "Virtual Environments (VE) and Training Technology",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Naval Warrior Performance (NWP)",
    "STO": "STO-2: Human Systems Design and Decision Support",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$26,200",
    "Actual total funding": "$5,750",
    "Last Updated": "12-23-2015"
  },
  {
    "Project ID": 4459,
    "Title": "AIR-4.6/4.5 AI, Autonomy, and Data Fusion Collaboration",
    "Topic/tracking number": "219WFD-ROT-18-037",
    "T-Code": "4.6T (Pax)",
    "TPOC": "Otten, Edward",
    "TPOC Email": "edward.otten@navy.mil",
    "TPOC code": "4.6.5.4",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Collaboration with AIR-4.5 in the areas of Artificial Intelligence, Autonomy, and Data Fusion. The focus of this rotation will be to acquire the principles and processes that are utilized by the Data Fusion group in support of acquisition programs. Additionally, as Level 5 of Data Fusion process is Human Machine Integration, the 4.6 employee will provide best practices from the Human-Computer Interaction group.",
    "Description": "Labor has been negotiated with the Associate Director of Research Programs. Travel and Material dollars will not be required.  This effort is in direct support of one of the Transformational Thrust areas: AI.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "06-18-2018",
    "End date": "12-19-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Human Systems Design and Decision Support",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$33,400",
    "Actual total funding": "$33,411",
    "Last Updated": "10-01-2018"
  },
  {
    "Project ID": 4589,
    "Title": "Next Generation Training Systems Development for Manned and Unmanned Concepts",
    "Topic/tracking number": "",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Pharmer, James",
    "TPOC Email": "james.pharmer@navy.mil",
    "TPOC code": 4.6,
    "Secondary TPOC": "Atkinson, Beth",
    "Secondary TPOC Email": "beth.atkinson@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "PMA205",
    "Objective": "Develop workforce skills in individual & team level training concepts that apply to future concepts for manned-unmanned team training environments including implementation of artificial intelligence, development of trust in automation in training, & applications for data science for performance assessment/effectiveness analyses.",
    "Description": "Technical Approach:\n-Develop new individual & team level training concepts that apply to operators & maintainer functions of future manned-unmanned teaming concepts within strategic growth focus areas\n-Identify unique tasks, knowledge, & skills associated with integrated manned-unmanned system concepts, specifically focusing on the training objectives for human-machine teaming\n-Identify potential advanced training technologies in strategic growth areas (e.g., intelligent tutoring, augmented/virtual reality, data analytics) & instructional strategies associated with manned-unmanned concepts for seamless integration between operational & training systems\n-Project will leverage/integrate on-going NAWCTSD Training efforts  in Ready Relevant Learning, Live, Virtual, Constructive for Training (LVCt ) and Autonomy/Artificial Intelligence as well as efforts being conducted by the other services\n\n\nProducts:\n-Year 1:  Preliminary use cases for individual & team level training concepts for manned-unmanned teaming\n\n\nNAWCAD Benefit/ Urgency:\n-Sr. Instructional System Designer and Research Psychologist (RP) mentoring early career ISD and RP working with Systems Engineering \n-Work activity is Pre-milestone A and exposes NAWCAD ISD personnel to full breadth of the acquisition RDT&E life-cycle that is rarely experienced.\n-Id. of unique training S&T challenges during developmental analyses will insure transition of advanced training technologies (e.g., impact AoA, ICD and CDD) at point of capability delivery to Future Vertical Lift FoS and other Manned-Unmanned Teaming Platforms.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE WFD",
    "Start date": "07-23-2018",
    "End date": "09-30-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Virtual Environments (VE) and Training Technology",
    "Core capability identifier": "",
    "Secondary core capability": "Human Systems Design and Decision Support",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "Enterprise and Platform Enablers (EPE)",
    "Secondary STO": "STO-2: Fixed Wing Platform Enablers",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$47,500",
    "Actual total funding": "$47,500",
    "Last Updated": "07-23-2018"
  },
  {
    "Project ID": 4617,
    "Title": "HUM PERF: Next Generation Training Systems Development for Manned and Unmanned Concepts",
    "Topic/tracking number": "219WFD-SG-18-049",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Pharmer, James",
    "TPOC Email": "james.pharmer@navy.mil",
    "TPOC code": 4.6,
    "Secondary TPOC": "Atkinson, Beth",
    "Secondary TPOC Email": "beth.atkinson@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop workforce skills in individual & team level training concepts that apply to future concepts for manned-unmanned team training environments including implementation of artificial intelligence, development of trust in automation in training, & applications for data science for performance assessment/effectiveness analyses.",
    "Description": "Develop workforce skills in individual & team level training concepts that apply to future concepts for manned-unmanned team training environments including implementation of artificial intelligence, development of trust in automation in training, & applications for data science for performance assessment/effectiveness analyses.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.0",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "08-01-2018",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Virtual Environments (VE) and Training Technology",
    "Core capability identifier": "",
    "Secondary core capability": "Human Systems Design and Decision Support",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "Enterprise and Platform Enablers (EPE)",
    "Secondary STO": "STO-2: Fixed Wing Platform Enablers",
    "I&I": "Strike Warfare (STW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$47,400",
    "Actual total funding": "$260,279",
    "Last Updated": "01-31-2019"
  },
  {
    "Project ID": 4723,
    "Title": "Deep Learning for Robotics Applications",
    "Topic/tracking number": "219WFD-TR-19-020",
    "T-Code": "4.8T",
    "TPOC": "Ramos, Christian",
    "TPOC Email": "christian.h.ramos@navy.mil",
    "TPOC code": "4.8.1.4",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "The objective of this training is to learn Deep Learning Convolutional Neural networks and their applicability to robotics computer vision applications.",
    "Description": "",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Robotics",
    "Core capability identifier": "",
    "Secondary core capability": "Controls, Sensors, and Instrumentation, and PHM for Mechanical Systems",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Non-Combat Operations (NCO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$8,000",
    "Actual total funding": "$12,910",
    "Last Updated": "09-25-2018"
  },
  {
    "Project ID": 4743,
    "Title": "Developmental Augmented Reality Training (DART)",
    "Topic/tracking number": "219WFD-TR-19-030",
    "T-Code": "4.8T",
    "TPOC": "Bowersock, Ryan",
    "TPOC Email": "ryan.bowersock@navy.mil",
    "TPOC code": "4.8.6.4",
    "Secondary TPOC": "Confessore, Michael",
    "Secondary TPOC Email": "michael.confessore@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "The objective of this Workforce Development (WFD) effort is to establish a knowledge base to support rapid, in-house augmented reality development with the Microsoft HoloLens. Any increased software design capabilities resulting from this training will be directly leveraged by a number of research projects looking at blending augmented reality technology with: machine vision/machine learning algorithms, head-mounted decision aids, robotics, interactive refresher tools, site familiarization programs, and iterative prototyping processes. A refined software skillset in this field will support speed to the fleet, improve sailor-information interfaces, provide valuable expertise to the NAVAIR Lakehurst workforce, and keep the Navy apace with current commercial, technological advancements.",
    "Description": "",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Cameras, Displays, and Optics",
    "Core capability identifier": "",
    "Secondary core capability": "Networks, Information Systems, and Intelligent Agents",
    "Secondary core capability identifier": "",
    "Capability gap": "Naval Warrior Performance (NWP)",
    "STO": "STO-2: Human Systems Design and Decision Support",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$11,660",
    "Actual total funding": "$11,664",
    "Last Updated": "09-27-2018"
  },
  {
    "Project ID": 4437,
    "Title": "IS18-24 Decision Aid for Blade Inspections",
    "Topic/tracking number": "219WFD-iSPR-18-018",
    "T-Code": "4.8T",
    "TPOC": "Thajudeen, Christopher",
    "TPOC Email": "chris.thajudeen@navy.mil",
    "TPOC code": "4.8.1.4",
    "Secondary TPOC": "Groszer, Todd",
    "Secondary TPOC Email": "todd.groszer@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop a decision aid technology for rotor-craft blade inspections: develop the core interfaces and algorithms required to autonomously detect faults in aircraft blades using existing ultrasonic sensors by employing signal processing techniques and machine learning. \nDeliverables:  1) White paper / findings of feasibility of automating fault detection of composite blades 2) lab demonstrator of fault detection and single processing system.",
    "Description": "The iSprint idea is to develop a decision aid technology for rotor-craft blade inspections. The effort will develop the core interfaces and algorithms required to autonomously detect faults in aircraft blades using existing ultrasonic sensors by employing signal processing techniques and machine learning. Development and feasibility will be analyzed using experimental data collected from an H-1 blade section using existing ultrasonic support equipment (bond master). \n\nThe S&T Products/ Deliverables for this effort will be twofold. First, a white paper / findings report will be generated to assess the feasibility of automating fault detection of composite blades using existing inspection equipment and applying signal processing algorithms to the data collected from an H-1 Blade section. Second, a lab demonstrator of fault detection and single processing system giving a go/no-go response will be developed.\n======================================================================\nThis study will develop and evaluate an automated decision aid for use with the existing inspection technology used on rotorcraft composite blade inspections, namely the BondMaster. To achieve this goal there are four primary tasks which will be accomplished as follows:\n1)\tA sensor interface between the computation hardware and the BondMaster needs to be developed\n2)\tThe H-1 blade setup will require a sensor positioning and fixture system\n3)\tExperimental data needs to be collected on a blade section for healthy and fault states\n4)\tData analysis and processing algorithms will be developed to automatically process the signals being generated and produce a go/no-go output for fault detection.\n\nThe estimated schedule for these tasks are shown in Figure 1. The total time required will be 6 weeks as many tasks can be completed in parallel. The execution of each task can be seen in Figure 1.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "07-23-2018",
    "End date": "09-21-2018",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "Controls, Sensors, and Instrumentation, and PHM for Mechanical Systems",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$40,000",
    "Actual total funding": "$49,524",
    "Last Updated": "10-22-2018"
  },
  {
    "Project ID": 4186,
    "Title": "MS in Computer Science, Jacob Rhodes",
    "Topic/tracking number": "219WFD-HE-18-021",
    "T-Code": "4.8T",
    "TPOC": "Rhodes, Jacob",
    "TPOC Email": "jacob.rhodes@navy.mil",
    "TPOC code": "4.8.3.1",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The overall objective of this effort is to advance my degree, expanding both the technical depth and breadth of my cybersecurity knowledge so as to help extend the capabilities within the AIR-4.8 and NAVAIR engineering community.  Obtaining a Master’s Degree in Computer Science, with a focus on intelligent systems, would allow for me to become more effective in supporting emerging cyber capabilities, such as Incident Response and Penetration Testing, as well as develop the skills needed for a prospective career path of becoming a Cyber Team Lead. As the Cyber Risk Assessment (CRA) Lead for both common and peculiar Support Equipment (SE) during NAVAIR’s NDAA-1647 efforts, I have seen the glaring need to apply new concepts to NAVAIR cybersecurity.  This effort will provide in-depth knowledge of machine intelligence and data science, which will allow for the implementation of more appropriate cybersecurity services that require less human interaction yet still have the ability to both detect and prevent anomalous behavior.",
    "Description": "The proposal is to complete the program within three years following the schedule below. This is possible by taking 1 course each term, with 4 terms per year (each of 10-12 weeks length).  Spring term classes are scheduled to start in early January CY 2018.\n\nThe costs indicated with each course and terms are currently posted by Johns Hopkins University. The textbook costs are estimated. These costs can vary on a year-by-year basis.\n\nFY18\nSemester\u0007Course Number\u0007Course Title\u0007Cost\u0007\u0007SpringCS-515 Computer Networks $3,701.00 Summer 605.601 Foundations of Software Engineering \u0007$4250.00\u0007\u0007 Fall 605.621 Foundations of Algorithms\u0007 $4250.00\u0007\u0007\nOther Fees\u0007Cost\u0007\u0007Textbooks\u0007$500\u0007\u0007FY18 Total Cost ~ $12701.00\nFY19\nSemester\u0007Course Number\u0007Course Title\u0007Cost\u0007\u0007Spring\u0007605.611 Foundations of Computer Architecture\u0007$4250.00\u0007\u0007 Summer\u0007 605.645 Artificial Intelligence \u0007$4250.00\u0007\u0007 Fall\u0007 605.649 Introduction to Machine Learning$4250.00\u0007\u0007 Fall 6095.744 Reverse Engineering and Vulnerability Analysis $4250.00\nOther Fees\u0007Cost\u0007\u0007Textbooks\u0007$500\u0007\u0007FY18 Total Cost ~ $17500\n\nFY20\nSemester\u0007Course Number\u0007Course Title\u0007Cost\u0007\u0007Spring\u0007 605.746 Advanced Machine Learning \u0007$4250.00 \u0007\u0007Summer 605.704 Object Oriented Analysis \u0007$4250.00 \u0007\u0007Fall\u0007 605.648 Data Science \u0007$4250.00\u0007\u0007\nOther Fees\u0007Cost\u0007\u0007Textbooks\u0007$500\u0007\u0007FY18 Total Cost ~ $13250.00",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "01-16-2018",
    "End date": "12-21-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Networks, Information Systems, and Intelligent Agents",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-6: Aircraft/Ship Integration",
    "Secondary capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "Secondary STO": "STO-2: Total Ownership Cost",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$43,000",
    "Actual total funding": "$30,701",
    "Last Updated": "11-06-2018"
  },
  {
    "Project ID": 4188,
    "Title": "MS in Computer Science, Samuel Pagano",
    "Topic/tracking number": "219WFD-HE-18-023",
    "T-Code": "4.8T",
    "TPOC": "Pagano, Samuel",
    "TPOC Email": "samuel.pagano@navy.mil",
    "TPOC code": "4.8.1.1",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The overall objective of this effort is to advance my education, degree, and develop my skillsets to best lead the integration of advanced technologies into our Navy Systems while ensuring positive cyber security processes are maintained during the development, fielding and sustainment phases. Obtaining a Master’s in Computer Science while focusing on utilizing Intelligent Systems would allow for me to become more effective when integrating and securing these technologies. In addition, understanding how evolving cyber threats affect systems will assist me in working with the IPTs early in the developmental process to mitigate and minimize schedule delays while increasing the overall cyber survivability of our systems. This degree and education will enhance my ability to drive these processes in my current role as a Lead Systems Engineer. This effort will provide in-depth knowledge of machine intelligence, data science, emerging security threats, and solutions to prepare the IPT to identify, develop, and implement strategies that ensure our systems and networks are secured.",
    "Description": "The proposal is to complete the program within three years following the schedule below. This is possible by taking 1-2 courses each term, with 3 terms per year (each of 10-12 weeks length). Spring term classes are scheduled to start in early January CY2018.\n\nThe costs indicated with each course and terms are currently posted by Johns Hopkins University. The textbook costs are estimated. These costs can vary on a year-by-year basis.\n\nFY18\nSemester\u0007Course Number\u0007Course Title\u0007Cost\u0007\u0007\nSpring\u0007CS-501B\u0007Program Development\u0007$3,614.00\n\u0007\u0007Spring\u0007CS-514 \u0007Networks\u0007$3,614.00\u0007\n\u0007Summer 605.202Data Structures$1,150.00\nFall 605.204Computer Organization$1,150.00\nFall 605.621Foundations of Algorithms$4,250.00\u0007\u0007\nOther Fees\u0007Cost\u0007\u0007Textbooks\u0007$600\u0007\u0007FY18 Total Cost ~ $14,383.00\nFY19\nSemester\u0007Course Number\u0007Course Title\u0007Cost\u0007\u0007\n\nSpring\u0007605.601Foundations of Software Engineering\u0007$4,250.00\n\u0007\u0007Spring\u0007605.611Foundations of Computer Architecture$4,250.00\nSummer605.645Artificial Intelligence$4,250.00\nFall605.649Introduction to Machine Learning$4,250.00\nFall695.744Reverse Engineering and Vulnerability Analysis$4,250.00\nOther Fees\u0007Cost\u0007\u0007Textbooks\u0007$600\n\u0007\u0007FY19 Total Cost ~ $21,850.00\n\nFY20\nSemester\u0007Course Number\u0007Course Title\u0007Cost\u0007\u0007\nSpring605.746Advanced Machine Learning$4,250.00\nSummer605.704Object Oriented Analysis and Design$4,250.00\nFall685.648Data Science$4,250.00\nOther Fees\u0007Cost\u0007\u0007Textbooks\u0007$500\u0007\u0007_x00B_\nFY20 Total Cost ~ $13,250.00",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "01-16-2018",
    "End date": "12-21-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Networks, Information Systems, and Intelligent Agents",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-6: Aircraft/Ship Integration",
    "Secondary capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "Secondary STO": "STO-2: Total Ownership Cost",
    "I&I": "N/A",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$49,500",
    "Actual total funding": "$49,478",
    "Last Updated": "10-30-2018"
  },
  {
    "Project ID": 4726,
    "Title": "MVISUAL: Maintainer's Visual Information System Using Augmented Reality",
    "Topic/tracking number": "219WFD-TR-19-023",
    "T-Code": "4.8T",
    "TPOC": "Kargbo, Ibrahim",
    "TPOC Email": "ibrahim.kargbo@navy.mil",
    "TPOC code": "4.8.6.2",
    "Secondary TPOC": "Collins, Vontrelle",
    "Secondary TPOC Email": "vontrelle.collins@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "This Workforce Development (WFD) effort will focus on building a knowledge base in the fields of computer vision and machine learning to train four members of the Integrated Support Equipment Avionics (ISEA) and Collaborative Research, Engineering, Analysis, and Testing in Immersive Virtual Environments (CREATIVE) Labs at NAVAIR Lakehurst in developing future technologies utilizing a combination of still images/Computer Aided Design (CAD) models with machine learning. The objective is to investigate methods to positively distinguish aircraft components along with Support Equipment (SE) and Aircraft Launch and Recovery Equipment (ALRE) components using CAD models and/or still camera images. The knowledge base gained from this effort will be directly applied to an FY20 BAR proposal to develop proof-of-concept, real-time object recognition software.",
    "Description": "Core Capabilities\nThe current members of the ISEA and CREATIVE Labs have a limited proficiency in the fields of machine learning, computer vision, and artificial intelligence. The intent of this effort is to develop an employee skillset that can be leveraged by numerous NAWCAD projects/programs to provide enhanced capability to the fleet and allow for rapid, in-house development of learning algorithms. Direct applications include those related to: traditional cameras and displays, augmented reality decision and maintenance aids, robotics, autonomous monitoring systems, and adaptive software. \n\nNAE Gaps/STOs\nThis effort directly supports Integrated Logistics Support (ILS) STO-2: Improved Maintenance Capability (“Develop automated, networked logistic systems so that aircraft diagnostic systems interface with parts requisition chains”) and Naval Warrior Performance (NWP) / STO-2: Human Systems Design and Decision Support (“human systems design to reduce manned and unmanned operator workload; decision-making; model processes related to situational awareness”). It is also endorsed by PMA260 (attached email in STAIRS from Matt Morgan, PMA260 S&T Portfolio Manager), who has Augmented Reality for Portable Electronic Maintenance Aids (PEMAs) on their S&T roadmap.",
    "Primary transition type": "I - Basic research exempt",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Cameras, Displays, and Optics",
    "Core capability identifier": "",
    "Secondary core capability": "Networks, Information Systems, and Intelligent Agents",
    "Secondary core capability identifier": "",
    "Capability gap": "Integrated Logistics Support (ILS)",
    "STO": "STO-2: Improved Maintenance Capability",
    "Secondary capability gap": "Naval Warrior Performance (NWP)",
    "Secondary STO": "STO-2: Human Systems Design and Decision Support",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$69,990",
    "Actual total funding": "$69,990",
    "Last Updated": "09-25-2018"
  },
  {
    "Project ID": 4355,
    "Title": "Artificially Intelligent Aerodynamics Prediction",
    "Topic/tracking number": "",
    "T-Code": "4.3T",
    "TPOC": "Napolillo, Zachary",
    "TPOC Email": "zachary.napolillo@navy.mil",
    "TPOC code": "4.3.2.1",
    "Secondary TPOC": "Allen, Jacob",
    "Secondary TPOC Email": "jacob.d.allen1@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop a capability to employ Machine Learning (ML) to the current aerodynamic database to quantify the relationships between the geometric features, wing load-outs, and flight conditions of stores/aircraft and their resulting aerodynamic coefficients/trajectories in order to provide data in support of flight clearances without the need for wind tunnel testing, simulation, or flight testing.",
    "Description": "- Establish a user-friendly and robust geometry parameter scheme.\n- Utilize and train a Support Vector Machine (SVM) algorithm to validate the geometry characterization scheme against the available freestream aerodynamic database. \n- Extend the capability of aerodynamic coefficient prediction to aircraft flow-field and trajectory data, if feasible.\n- Validate the Artificial Intelligence models by generating freestream, flow-field, and trajectory data for a future wind tunnel and/or flight test event prior to the test.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.3",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE WFD",
    "Start date": "08-13-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$146,000",
    "Actual total funding": "",
    "Last Updated": "07-18-2018"
  },
  {
    "Project ID": 4897,
    "Title": "Universal Hub Enterprise Data Catalog",
    "Topic/tracking number": "",
    "T-Code": "4.8T",
    "TPOC": "Jaworowski, Chris",
    "TPOC Email": "christopher.jaworows@navy.mil",
    "TPOC code": 4.8,
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The US Navy needs a cross system command Navy Warfare Center unified repository of standardized Navy data to be available for solving problems using machine learning methodology.  The lack of awareness on existing data sources and the lack of availability of these sources prevent data scientists and system analysts from enabling Machine Learning applications to be used for fleet support. This project is part of a cross Naval Research and Development Establishment (NR&DE) to establish a framework of data collection and data management capability to provide a unified repository of standardized Navy data to be used for Machine Learning application. This project focuses on the first stage of UHEDC which is the creation of a Navy Data Card Catalog. The objective of this work is to collate existing data and process NAWCAD machine learning data calls.",
    "Description": "The Navy Enterprise Universal Repository for Analytical Learning (NEURAL) project can be separated into four major stages of data access. These areas are highly related to each other in terms of function and effectiveness. Each stage provides a significant impact to the overall process and as such they should be identified to help activities find a solution. To ensure clarity, each stage is introduced in this paper to help with familiarity of the topic within the framework. This is expected to be a multi-year effort for the completion of the data repository and its sustainment strategy due to the complexity of the project and the involvement across all warfare centers.\n\nCreation of Navy Data Card Catalog – Proposed for FY19\nThe first stage of this effort will address the lack of visibility between warfare centers to identify potential datasets that could be used in machine learning or other advanced analytical methods to address Navy issues in an impactful way. The development of a comprehensive card catalog with information on available data sets used by each participating command will allow data scientists to request data or at least open dialogue with the owner of the data. A Community of Practice (COP) shall be stood up to provide consistent communication to ensure the card catalog will be as complete as possible while new information will be continuously updated. Early research on standardized metadata structure and cybersecurity requirement shall be conducted to prepare for the next stage. If a relatable data environment is available for hosting data, a sample set of data shall be ingested to demonstrate potential use cases to interested sponsors.\n\n2.1.2 Identification of Data Dictionary and Data Access – Projected for FY20\nThis stage involves construction of the appropriate, standardized metadata layer to ensure the future data repository will have clearly understood field names and definitions for data scientists to explore the data without spending tremendous effort to scrub the data into usable format. The appropriate solution for accessibility with a documented process to address cybersecurity, information assurance, and classification shall be developed and disseminated by the community to ensure all participating commands have the right and knowledge to use the data repository. The plan to develop the data repository shall be finalized to ensure each warfare center has the appropriate means to connect to the environment to support machine learning applications.\n\nCreation of Data Repository – Projected for FY20 Q3 or FY21 (Could be parallel with 2.1.2 effort)\nThis stage involves the development of the data repository infrastructure. Each warfare center shall establish the process and infrastructure capability to push data from data sources into the data repository. Engineers and data scientists shall be able to access the data sets readily. Data life cycle management plan shall be developed to provide guidance to organizations and administration teams on sustaining available data sets from ingestion to destruction.\n\nCreation of Data Enrichment Process – Projected for FY22\nThis stage addresses the creation of the new features and metadata generated from the machine learning efforts across the participating commands. Appropriate measures shall be taken to ensure newly generated information from machine learning efforts will be managed without affecting the performance of the data repository as well as the authenticity of the original data sources. Reports and outputs sent to sponsors shall be marked appropriately to identify original data sources and/or generated information has been used to support a decision. The sustainment process shall be developed to ensure the repository is maintained within the original purpose of providing data scientists access to relevant data for machine learning applications.",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Suspended (Technical Effort Awaiting)",
    "Reason for cancellation": "",
    "Core capability": "Networks, Information Systems, and Intelligent Agents",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-4: Computing, Processing, and Architectures",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Information Operations (IO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "",
    "Estimated TRL at completion": "TRL 7",
    "Estimated total funding": "$61,000",
    "Actual total funding": "",
    "Last Updated": "01-14-2019"
  },
  {
    "Project ID": 4708,
    "Title": "Aircraft Component Tracking System (ACTS) Enterprise Edition",
    "Topic/tracking number": "RIF-17-196",
    "T-Code": "NAVAIR",
    "TPOC": "Carter, Jason",
    "TPOC Email": "jason.carter1@navy.mil",
    "TPOC code": "PMA-299",
    "Secondary TPOC": "Slade, Shawn",
    "Secondary TPOC Email": "shawn.slade@navy.mil",
    "Portfolio": "PEO(A)-ASW",
    "Primary supporting PMA": "PMA299 (ASW)",
    "Interested PMA(s)": "",
    "Objective": "Take the existing ACTS source code and convert it to the required AIR-6.8 Authority to Operate (ATO) source code. An enterprise version of ACTS supports the USN’s end goal of tracking all rotary wing and fixed wing component usage in near real-time, gathering complete component history and thereby more accurately predicting the life of each component.",
    "Description": "The contractor, TDA, will take the existing Java-based source code for ACTS and convert it to the required AIR-6.8 ATO source code. It is anticipated that this code will be .NET; the following work is predicated on that assumption. As part of this conversion, TDA will revise the application architecture to incorporate a more robust event sourcing model. In an effort to improve imported legacy data, TDA will implement an innovative machine learning data import/conversion.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA299 (ASW)",
    "Funds provided by": "Navy",
    "Funding source": "Rapid Innovation Fund",
    "Start date": "08-15-2018",
    "End date": "08-17-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Integrated Logistics Support (ILS)",
    "STO": "STO-2: Improved Maintenance Capability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 5",
    "Current TRL": "",
    "Estimated TRL at completion": "TRL 8",
    "Estimated total funding": "$2,086,000",
    "Actual total funding": "$2,086,000",
    "Last Updated": "09-20-2018"
  },
  {
    "Project ID": 7020,
    "Title": "PROC ENAB: Artificially Intelligent Aerodynamics Prediction",
    "Topic/tracking number": "219WFD-SG-18-055",
    "T-Code": "4.3T",
    "TPOC": "Napolillo, Zachary",
    "TPOC Email": "zachary.napolillo@navy.mil",
    "TPOC code": "4.3.2.1",
    "Secondary TPOC": "Allen, Jacob",
    "Secondary TPOC Email": "jacob.d.allen1@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Employ Machine Learning (ML) algorithms to the current store separation wind tunnel aerodynamic database to quantify the relationships between store geometries, configurations, and flight conditions and their corresponding aerodynamic coefficients/trajectories in order to provide data in support of flight clearances in order to minimize the need for wind tunnel testing, simulation, or flight testing.\n\nThe deliverable for the effort will be a Technical Final Report.",
    "Description": "FY18 – Initial Startup (Recommended During Proposal Presentation)\nLabor - $10.78K\nRetrieval, sorting, and preprocessing of available freestream aerodynamic data. (ZGN)\nSourcing of SVM research/textbook materials. (ZGN)\nMaterials - $.25K:\nObtain research texts. (ZGN)\nFY19 - Year 1\nLabor - $43.34K:\nFinalize aerodynamic freestream database preparation. (ZGN)\nEstablish a robust store parameterization scheme which allows for high prediction accuracy. (ZGN)\nBegin freestream SVM model training to validate the parameterization scheme in iterative process. (ZGN)\nMaterial - $1K:\nObtain source materials and data storage hardware.\nFY20 - Year 2\nLabor - $43.56K:\nFinalize freestream model training along with validation against a test set. (ZGN)\nPreparation of flow-field database. (ZGN)\nExtend the parameter scheme to aircraft flow-field data. (ZGN)\nInitiation of SVM flow-field model training in iterative process with parameter validation. (ZGN)\nFinal validation of flow-field model against training set. (ZGN)\nMaterial - $5K:\nReserved in the event specialized hardware is required to speed-up SVM model training. (ZGN)\nFY21 - Year 3\nLabor - $43.77K:\nAssess feasibility of trajectory modeling using the flow-field parameter scheme to train a trajectory model. (ZGN)\nValidate all models against real-world test by predicting results. (ZGN)\nReport on results in the form of publication. (ZGN)\nTravel: - $5K:\nAttend Conference and present results. (ZGN)",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.3",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "09-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$165,200",
    "Actual total funding": "$185,832",
    "Last Updated": "04-01-2019"
  },
  {
    "Project ID": 4840,
    "Title": "Data Analytics for Navy Aircraft Component Fatigue Life Management",
    "Topic/tracking number": "N182-100",
    "T-Code": "4.3T",
    "TPOC": "Semidey, Roberto",
    "TPOC Email": "roberto.semidey@navy.mil",
    "TPOC code": "4.3.3.2",
    "Secondary TPOC": "Glucksman-Glaser, Mark",
    "Secondary TPOC Email": "Mark.GlucksmanGlaser@Navy.mil",
    "Portfolio": "PEO(A)-Rotary",
    "Primary supporting PMA": "PMA276",
    "Interested PMA(s)": "PMA261, PMA268, PMA275",
    "Objective": "Develop a suite of novel data analysis tools, and the integration of data mining with physics-based models, to quickly assess current rotorcraft diagnostic state, make predictive life analysis, detect and address anomalies, and provide a complete traceability of part history.",
    "Description": "Navy aircraft data are stored in several database management systems, both in digital format and paper records. Each of the Navy’s type/model/series aircraft has its own data characteristics which depend on several factors such as aircraft category (i.e. fixed or rotorcraft), installed data recorders and sensors (such as the Integrated Mechanical Diagnostics System or the Vibration, Structural Life, and Engine Diagnostics System), any unique functional line duties and records which would be needed during maintenance service events (such as remove and replace, service fluids, inspection criteria, etc.).\nAdditionally, the NAVAIR Enterprise Condition Based Maintenance Plus (eCBM+) team encourages solutions which support an open architecture data management and engineering analysis environment. \nSpecifically, with respect to life management and maintenance, and repair and overhaul (MRO) activities, numerous data are collected and stored at various geographical locations in different management and computer systems. Because of this architecture, there is multiplicity in data, some contradictory data, and incomplete data. Conservative engineering judgments are often made to resolve these data inconsistencies when it is difficult or not possible, to correct or rebuild all datasets. Many times the aircraft life is penalized for these data discrepancies.\nAn analysis toolset is needed with a reasoning engine that: interfaces directly or indirectly with aircraft and external data systems; can provide current diagnostic state of the aircraft; and is able to make component life predictions. Developing this analysis tool will require describing types of data sets, constructing/adopting necessary standards and metadata, machine learning (ML) algorithms, predictive analysis, and presenting the required data to the end-user in a convenient but familiar and decision ready format. Pre-processed data to be aggregated will include large maintenance datasets (e.g. part installs/removals, pilot flight reports, inspection records, teardowns, and field tech reports), operator information (e.g. mission types, locations), flight test data (e.g. Health and Usage Management Systems (HUMS)), and engineering data (e.g. design specifications, technical drawings, manuals,  failure modes, on-ground tests). New paradigms on data transformation, data mapping, data mining and data visualization should be explored for enhancing the data processing capability of current systems and processes. The data processing should result in useful interfaces including, but not limited to: a current snapshot of the aircraft health since the last inspection, load spectrum development, schedule indicating the next inspection time, updates on component retirement, component replacement prioritization, updates identifying events of interest, event root cause analysis, and risk assessment. The system  should be able to identify and extract such useful knowledge from large quantities of data for making informed decisions on aircraft state and its components. Resilience to both data and processing faults is sought as faults can cause data corruption and can have many different sources due to software bugs and hardware errors. The analysis toolset needs to be: (1) able to handle structured and unstructured data, (2) able to identify and resolve data quality issues, (3) resilient to both data and processing faults, (4) quick (e.g. have a low latency retrieval of data ranging between 24-48 hours depending on criticality of alert or action needed), (5) based on modular, user-friendly, highly-customizable applications that will respond to the different functional end-user needs, and (6) easily scalable. Lastly, the analysis toolset should be fully compatible with existing Navy and Marine Corps Intranet (NMCI) and logistics enterprise systems, including but not limited to relational database management systems, open source architecture, Java, Python, web compatibility (e.g. ozone widget framework), and support for Public Key Infrastructure (PKI) certificate login. The solution must meet the system DoD accreditation and certification requirements as cited in DoDI 8510.01, Risk Management Framework (RMF) for DoD Information Technology (IT), and DoDI 8500.01, Cybersecurity.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA276",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "09-10-2018",
    "End date": "03-13-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Advanced Airframe Structures and Materials",
    "Core capability identifier": "1.1.3.2",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$0",
    "Actual total funding": "$374,873",
    "Last Updated": "03-11-2019"
  },
  {
    "Project ID": 1922,
    "Title": "New Methods for Photogrammetric Target Acquisition Tracking and Analysis",
    "Topic/tracking number": "219BAR-10-042",
    "T-Code": "5.2T",
    "TPOC": "Forsman, Ed",
    "TPOC Email": "alec.forsman@navy.mil",
    "TPOC code": 5.2,
    "Secondary TPOC": "Schug, David",
    "Secondary TPOC Email": "david.schug@navy.mil",
    "Portfolio": "PEO(A)-Rotary",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "We will create a new method to acquire, track and analyze photogrammetric data using a variety of novel techniques.",
    "Description": "The research product will be the key technological components of a system that processes photogrammetric data much more quickly.  We will attack the 2-D image sequence target acquisition and tracking problems by using wavelet-based transforms to segment out and locate targets of each specific type (for example, fiducial or “bow-tie” targets). By using machine learning to adaptively",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-5.2",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2009",
    "End date": "09-30-2014",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Force Protection (FP)",
    "STO": "STO-1:  Platform Survivability",
    "Secondary capability gap": "Strike Operations (STK)",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "TRL 6",
    "Estimated TRL at completion": "TRL 6",
    "Estimated total funding": "$470,000",
    "Actual total funding": "$674,509",
    "Last Updated": "07-20-2018"
  },
  {
    "Project ID": 6986,
    "Title": "MISS CAP: AFSIM Development for Effectiveness Modeling",
    "Topic/tracking number": "219WFD-SG-19-011",
    "T-Code": "4.0M",
    "TPOC": "Brierty, Gina",
    "TPOC Email": "gina.brierty@navy.mil",
    "TPOC code": "4.10.2.1",
    "Secondary TPOC": "King, Jesse",
    "Secondary TPOC Email": "jesse.king2@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The objective of this project is to generate a common framework for engagement level analysis across multiple mission areas (Air Warfare (AW); Intelligence, Surveillance, and Reconnaissance (ISR); and Anti-Submarine Warfare (ASW)) using the Advanced Framework for Simulation, Integration and Modeling (AFSIM). Results will enable cross-domain modeling across several warfare areas, better re-use of modeling efforts, and timely effectiveness assessments to support acquisition decisions.",
    "Description": "The project plan for AFSIM development, analysis, and integration is provided below.\nOct – Nov 2018: Training and Project Planning (Labor: $15K; Travel: $15K*)\nDevelop core competence to use and develop models in AFSIM by sending a small group of analysts to basic and developer AFSIM training.\nIdentify one kill chain for both AW and ASW to develop in the tool relevant to ongoing / future projects, such as the N98 Naval Aviation Capabilities Based Assessment Integrated Process (NCIP) to support OPNAV POM investment decisions.\n(Dec – Apr 2018) Model Development and Analysis (Labor: $50K)\nDevelop scenarios in model for AW and ASW identified kill chains.\nEstablish computing environment.\nGather threat and blue (US Navy) system performance data from Office of Naval Intelligence and PMAs.\nBuild threat system database and behaviors.\nBuild blue capabilities database.\nGenerate blue Concepts of Employment (CONEMPs).\nVerify system capability and CONEMP representation in model.\nRun models and analyze results.\n(May - June 2018) Model Test and Validation (Labor: $30K)\nCompare results to previous values from legacy models for validation.\n(July – Aug 2018) Model Integration (Labor: $15K)\nIncorporate new modeling construct into existing model frameworks to enable robust, quick-turn engagement level analysis.\n(Sept 2018) Final Brief (Labor: $10K)\nDevelop final brief with results, initial validation efforts, and recommendations.\n*Travel amount of $15K includes travel for 10 4.0M team members to participate in the one week basic AFSIM training course in Dayton, OH. No tuition required.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.0M",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Anti-Air Warfare (AAW)",
    "Secondary I&I": "Anti-Submarine Warfare (ASW)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$137,400",
    "Actual total funding": "$148,931",
    "Last Updated": "03-28-2019"
  },
  {
    "Project ID": 4373,
    "Title": "ADV TECH: Big Data Analytics in Support of Fleet Readiness",
    "Topic/tracking number": "219TT-RPC-19-001",
    "T-Code": "4.4T",
    "TPOC": "Nacker, John",
    "TPOC Email": "john.nacker@navy.mil",
    "TPOC code": "4.4.2.2",
    "Secondary TPOC": "Amin, Sanket",
    "Secondary TPOC Email": "sanket.amin@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "JSF",
    "Objective": "This proposed effort supports development of critical capabilities to readily access, manage, analyze, and extract value from fixed-wing operational “smart aircraft” big data sources via custom-tailored solutions that provide value to the fleet by improving safety, readiness, and total ownership cost (TOC).  AIR 4.4 previously executed a very successful NISE effort that accomplished the same objective for rotorcraft data.  As a result, the rotorcraft community has seen significant positive and ongoing benefits with documented savings of $34M to date, readiness improvements (i.e., demonstrated reduction in turnaround time from one month for complete main gearbox replacement to one week for module replacement by identifying and replacing only the failing module on a significant number of aircraft), and avoidance of 25 precautionary emergency landings (PELs). This fixed-wing focused effort will take an existing, but limited, labor-intensive data collection & analysis process that has already demonstrated value for the fleet and (1) productionize the parsing and ingestion of data to a recently obtained big data analytics system, (2) standardize existing analysis methods, and (3) develop new data analytics methods (i.e., incoming data screening & cleansing, new algorithm development, machine learning, automated alerting, context relevant visualization, and fleet reporting) and disseminate actionable information to Fleet Support Team (FST) and fleet.  It will also leverage opportunities to collaborate with a parallel, AIR-6.8 organic data-collection effort for potential long-term data flow into the big data analytics system and eventual integration into the NAVAIR enterprise Condition-Based Maintenance Plus (eCBM+) architecture.",
    "Description": "Year 1 (FY19):\nUsers are able to navigate the JSF Knowledge Management (KM) system, develop their own basic queries & analyses, evaluate analytic results, derive meaningful & actionable information, and communicate findings via intuitive reports.\n\nYear 2 (FY20):\nUsers develop their own tools and dashboards to support fleet needs. At a minimum, actionable plans are developed to (1) extend access to the data analytics system beyond the Bldg. 2850 footprint (e.g., other PAX bldgs., FST sites, etc.), (2) organically access fleet data, and (3) integrate the data analytic capabilities and data into an eCBM+ architecture for enterprise access and sustainment.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-6.8",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE Tech Transition",
    "Start date": "10-01-2018",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "State-Based Management of Dynamic Components",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Integrated Logistics Support (ILS)",
    "STO": "STO-2: Improved Maintenance Capability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 6",
    "Current TRL": "TRL 6",
    "Estimated TRL at completion": "TRL 7",
    "Estimated total funding": "$261,899",
    "Actual total funding": "$142,065",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 7004,
    "Title": "ADV TECH: Machine Learning for Data Fusion to Improve Target Tracking",
    "Topic/tracking number": "219BAR-19-014",
    "T-Code": "4.5T",
    "TPOC": "Six, William",
    "TPOC Email": "william.e.six@navy.mil",
    "TPOC code": "4.5.5.3",
    "Secondary TPOC": "Rea, Charles",
    "Secondary TPOC Email": "charles.rea@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Improve target tracking and data fusion qualities by utilizing Machine Learning and Artificial Intelligence techniques. Specifically targeting improved kinematic accuracy, track consistency (duration, reduce redundancy, breaks, and switching), decreasing the probability of missed or incorrect association, and reducing computational requirements to achieve a given kinematic accuracy (compared to particle and grid based filters) for maneuvering targets in multi-INT scenarios (ex. Triton, EP-3E, or F-35).",
    "Description": "Year 1 - Create baseline scenarios with realistic truth data and sensor data.  Evaluate data fusion performance using SIAP metrics as well as metrics defined by the Data Fusion Lab/Toyon.  Apply machine learning algorithms, such as LSTM, CNNs, to target tracking, and compare the performance.\nTask 1.1) Create realistic scenario using SLAMEM\nTask 1.2) Acquire data extractions (DX) from real flight tests, using AIS data as “truth”. Currently Triton IFC-3, E2-D, and MH-60R data is available. \nTask 1.3) Train LSTM both on linear, and on non-linear motion.\nTask 1.4) Author paper for submission to International Society of Information Fusion (peer reviewed IEEE conference), Military Sensing Symposium – National Symposium on Sensing and Data Fusion (MSS-NSSDF), and Science and Technology Organization Specialists Meeting on “Artificial Intelligence for Military Multi-sensor Fusion”\n\nYear 2 - Apply machine learning techniques to distinguish clutter from surveillance region.\nTask 2.1) Create baseline algorithms for track formation in a multi-sensor, multi-target environment\nTask 2.2) Create/use metrics for determining track formation both indirectly (SIAP metrics), and directly, as done by Rea, Silbert, and Agate in “Quantifying Data Association Performance of a Data Fusion System”, 2017.\nTask 2.3) Apply convolution neural net (CNN) and other machine learning algorithms to “learn” measurement to track association.\nTask 2.4) Document results and submit to peer reviewed conferences and journals such as MSS-NSSDF, ISIF, and SPIE Defense Sensing Symposium.",
    "Primary transition type": "I - Basic research exempt",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2018",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Radar and Antenna Systems Capability",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-1: Command and Control",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "Command, Control, and Communications (CCC)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$361,900",
    "Actual total funding": "$318,840",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 4697,
    "Title": "Scientific and Technical Intelligence Training",
    "Topic/tracking number": "219WFD-TR-19-003",
    "T-Code": "4.0M",
    "TPOC": "Wiegman, Kristi",
    "TPOC Email": "kristi.wiegman@navy.mil",
    "TPOC code": "4.0T",
    "Secondary TPOC": "Dennie-Young, Kris",
    "Secondary TPOC Email": "kris.dennie-young@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Train new employees on specialized intelligence analysis skills and emergent technology areas (including artificial intelligence, cyber, electronic warfare, etc).  The Scientific and Technical Intelligence Liaison Office (STILO) is responsible for providing current, validated intelligence to support Naval program developments. The complexity and speed of technological developments demand robust and current technical competence and analytical skills in order to provide timely insertion of threat information at the earliest phase of the system development cycle.",
    "Description": "Train new employees on specialized intelligence analysis skills and emergent technology areas (including artificial intelligence, cyber, electronic warfare, etc).  The Scientific and Technical Intelligence Liaison Office (STILO) is responsible for providing current, validated intelligence to support Naval program developments. The complexity and speed of technological developments demand robust and current technical competence and analytical skills in order to provide timely insertion of threat information at the earliest phase of the system development cycle.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.0M",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$47,300",
    "Actual total funding": "$47,272",
    "Last Updated": "09-17-2018"
  },
  {
    "Project ID": 4317,
    "Title": "Automation, Electronics, and Embedded Software Skill Development",
    "Topic/tracking number": "219WFD-iMTR-18-002",
    "T-Code": "4.11T",
    "TPOC": "Farry, Kristin",
    "TPOC Email": "kristin.farry@navy.mil",
    "TPOC code": 4.11,
    "Secondary TPOC": "Jordan, Israel",
    "Secondary TPOC Email": "israel.jordan@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Participating mentees (ESDPs) adopt an Innovation Kit (iKit) in the Innovation Garage that is designed to develop embedded software, electronics, integration, automation, and sensor fusion skills.  They will become the technical expert on that kit under the guidance of Dr. Kristin Farry and other 4.11 and 4.5 SMEs.  Each mentee will enhance the documentation on their iKit, then develop a short (2-3 hour) introductory course based on it.  They will teach this course to at least three other more senior government employees, and then mentor these students through follow-on experimentation with the iKit.  iKits to be used and advanced include automation, sensor integration, GPS, software-defined radio, LiDAR, radar, Internet of Things, and tablet/iPhone remote control application development.   A few projects will involve expansion of the iKits (eg, additional automation exploration options, artificial intelligence, and more advanced GPS).",
    "Description": "Labor for each iKit project is up to 160-200 hours.  The mentee will be assigned an innovation kit and specific hands-on learning goals, with a progress assessment every 10 hours.  As the mentee learns, s/he will improve the iKit documentation and contents to make it more accessible to SMEs wanting to do self-paced learning.  Once comfortable with the iKit technology, the mentee will develop a 2-4 hour introductory mini-course for the technology and rehearse it with their mentor.  The course will then be offered on NAVAIRU for anyone in the government workforce.  The mentee will teach the course to “kickstart” their colleagues on their own iKit experimentation, and then mentor their students through follow-on experimentation to build their skills.  The mentee will also assist the Innovation Garage manager on technical issues that arise with the iKit.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "03-15-2018",
    "End date": "09-30-2018",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-6: Aircraft/Ship Integration",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-4: Computing, Processing, and Architectures",
    "I&I": "Expeditionary Warfare (EXW)",
    "Secondary I&I": "Naval Special Warfare (NSW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$90,000",
    "Actual total funding": "$89,911",
    "Last Updated": "11-27-2018"
  },
  {
    "Project ID": 4699,
    "Title": "Cognitive Radio Technology Workforce Development Training",
    "Topic/tracking number": "219WFD-TR-19-005",
    "T-Code": "4.11T",
    "TPOC": "Stack, William",
    "TPOC Email": "william.stack@navy.mil",
    "TPOC code": "4.11.4",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "This training project will conduct on-site training in Cognitive Radio principles and technology for military communications, enabling Government organic Lead Systems Integrators to immediately employ advanced cognitive radio capabilities to meet emerging threats to military communications from near-peer and peer adversaries.  Cognitive radio fuses powerful techniques taken from artificial intelligence (AI), game theory, wideband/multiple antenna techniques, information theory and statistical signal processing to create  dynamic behavior.  This behavior can then be used to counter threats posed by jamming in denied environments as well as take advantage of unused spectrum to automatically and efficiently provide data communications.",
    "Description": "WFD Training for Cognitive Radio Technology",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "01-01-2019",
    "End date": "03-31-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-1: Command and Control",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-2: Communications and Networks",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$25,000",
    "Actual total funding": "$25,000",
    "Last Updated": "04-16-2019"
  },
  {
    "Project ID": 4767,
    "Title": "iMENTOR: MP19-11:  Automation, Electronics, and Embedded Software Skill Development",
    "Topic/tracking number": "219WFD-iMTR-19-004",
    "T-Code": "4.11T",
    "TPOC": "Farry, Kristin",
    "TPOC Email": "kristin.farry@navy.mil",
    "TPOC code": 4.11,
    "Secondary TPOC": "Groszer, Todd",
    "Secondary TPOC Email": "todd.groszer@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "5-6 Mentees (ESDPs) will each adopt an Innovation Kit (iKit) in the Innovation Garage that is designed to develop embedded software, integration, automation, and sensor fusion skills.  They will become the technical expert on that kit ….include mobile robotics, infrared image processing, sensor integration, MBSE, GPS, advanced software-defined radio, LiDAR, radar, and tablet/iPhone remote control application development.",
    "Description": "Participating mentees (ESDPs) will each adopt an Innovation Kit (iKit) in the Innovation Garage that is designed to develop embedded software, integration, automation, and sensor fusion skills.  They will become the technical expert on that kit under the guidance of Dr. Kristin Farry, Dr. Ann Reagan, Andrian Jordan, and other NAWCAD SMEs.  Each mentee will enhance the documentation on an iKit.  Where appropriate, they will develop a short (2-3 hour) introductory course based on it.  They will teach this course to at least two other government employees, and mentor these students through follow-on experimentation with the iKit.  iKits to be used and advanced include mobile robotics, infrared image processing, sensor integration, MBSE, GPS, advanced software-defined radio, LiDAR, radar, and tablet/iPhone remote control application development.   Projects will typically include expansion of the existing iKits and in some cases defining new iKits (eg, mobile robotics, automation exploration options, artificial intelligence).\n\nLabor for each iKit project will be 160-200 hours.  The mentee will be assigned an innovation kit and specific hands-on learning goals, with a progress assessment every 10 hours.  As the mentee learns, s/he will improve the iKit documentation and contents to make it more accessible to SMEs wanting to do self-paced learning.  Once comfortable with the iKit technology, the mentee will develop a 2-4 hour introductory mini-course for the technology and rehearse it with their mentor.  The course will then be offered on NAVAIRU for anyone in the government workforce.  The mentee will teach the course to “kickstart” their colleagues on their own iKit experimentation, and then mentor their students through follow-on experimentation to build their skills.  The mentee will also assist the Innovation Garage manager on technical issues that arise with the iKit.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "12-09-2018",
    "End date": "08-15-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-6: Aircraft/Ship Integration",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "Expeditionary Warfare (EXW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$60,000",
    "Actual total funding": "$59,999",
    "Last Updated": "01-31-2019"
  },
  {
    "Project ID": 7032,
    "Title": "Master's Degree Information Technology : Systems Engineering -- Elliott",
    "Topic/tracking number": "219WFD-HE-19-022",
    "T-Code": "4.11T",
    "TPOC": "Elliott, Shaun",
    "TPOC Email": "shaun.elliott@navy.mil",
    "TPOC code": "4.11.3",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "The completion of this proposed Master of Science in Information Technology: Systems Engineering degree would allow me to become a competent, well-prepared, and qualified Information Technology System Engineer for NAWCAD and the warfighter.  This degree will enable me to enhance NAWCAD-4.11 Air-Ship Integration capability deliveries to the warfighter that require a greater understanding of current and Artificial Intelligence, complex technical architectures, and systems engineering disciplines. This degree program is aligned with the 2018 National Defense Strategy to build a more lethal force by enhancing my ability to deliver performance at the speed of relevance in C4ISR, Cyberspace, and Advanced Autonomous Systems and deepening interoperability.",
    "Description": "",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "07-03-2019",
    "End date": "03-14-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-2: Communications and Networks",
    "I&I": "Information Operations (IO)",
    "Secondary I&I": "Command, Control, and Communications (CCC)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$20,200",
    "Actual total funding": "$20,200",
    "Last Updated": "03-27-2019"
  },
  {
    "Project ID": 6991,
    "Title": "CYB: MIL-STD 1553 AI-Enhanced Anomaly Detection",
    "Topic/tracking number": "219BAR-19-010",
    "T-Code": "4.5T",
    "TPOC": "Rickard, Kristina",
    "TPOC Email": "kristina.rickard@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Rea, Charles",
    "Secondary TPOC Email": "charles.rea@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop artificial intelligence algorithms capable of learning the behavior of embedded aircraft systems to detect, alert, and prevent cyber threats.",
    "Description": "FY19 Tasks: (Labor: $220K, Material: $15K, Travel: $15K)\nInvestigate body of work – Study IP-based machine learning algorithms and their applications in non IP-based traffic monitoring. Current programs include DarkTrace Enterprise Immune System, PLAID, and VENCORE Bus Defender.\nInitial 1553 dataset – Consult and work with SMEs in NAVAIR to acquire and label 1553 training data for the algorithm.\nInitial algorithm/initial testing – Development of algorithms will occur in 4.5.5.3 laboratory space. Simulated and/or actual aircraft 1553 messages will be used to train the algorithm to normal message traffic. Various abnormal and/or malformed messages will be injected into the bus to determine the efficacy of the algorithms to detect anomalies.\nLabor:\n\tNicole Thompson (50% MY)\n\tDustin Wheeler (50% MY)\n\tESDP/Journeyman (50% MY)\nMaterial: \nLab fee to maintain state of the art equipment in the lab.\nTravel:\n\tAISec2018 – October 19, 2018\n\tSET-262 RSM on Artificial Intelligence for Military Multisensor Fusion Engines – November 5-6, 2018\n\tOther industry-standard conferences and/or training as funding allows\nFY20 Tasks: (Labor: $231K, Material: $100K, Travel: $15K)\nExpand 1553 dataset – Continue aggregating and labeling 1553 data from multiple sources. Create simulated data if necessary. \nDesign/Develop /Refine Algorithms – Continue porting the latest research from industry into the algorithms powering the 1553 IDS/IPS. \nBuild 1553 Test Bench – Procure and build a 1553 test bench that will be used to develop and test the AI algorithms. \nIterate Test Methodology – Benchmark algorithms and track progress and efficiency through development. Formalize test methods and document test results. \nLabor:\n\tNicole Thompson (50% MY)\n\tDustin Wheeler (50% MY)\n\tESDP/Journeyman (50% MY)\nMaterial: \nLab fee to maintain state of the art equipment in the lab.\n1553 test bench equipment. Efforts will be made to borrow equipment from other NAVAIR labs to mitigate equipment cost. However, as exclusive use of a 1553 test bench is a make or break criteria of this proposal, material funding is allocated to procure equipment if none can be borrowed. \nTravel:\n\t2-3 Industry-standard conferences and/or training events relating to AI and Cybersecurity\nDue to changing annual themes of industry-standard conferences, specific conference and training decisions will be made closer to event dates.\nFY21 Tasks: (Labor: $242K, Material: $15K, Travel: $15K)\nContinue to expand 1553 dataset – Collaborate with more programs across NAVAIR to acquire relevant 1553 data for testing.\nRefined algorithm/complete testing – Finalize winning algorithm and complete comprehensive testing on multiple datasets. \nDocument results – Complete documentation describing the final algorithm, the process involved in developing the algorithm, and the test results of the final algorithm. Author, publish, and present papers and briefs on the above activities in peer reviewed journals and DoD publications.\nLabor:\n\tNicole Thompson (50% MY)\n\tDustin Wheeler (50% MY)\n\tESDP/Journeyman (50% MY)\nMaterial: \nLab fee to maintain state of the art equipment in the lab.\nTravel:\n2-3 Industry-standard conferences and/or training events relating to AI and Cybersecurity\nDue to changing annual themes of industry-standard conferences, specific conference and training decisions will be made closer to event dates.",
    "Primary transition type": "I - Basic research exempt",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-5: Cyber Defense- Information Assurance (IA) and Network Protection",
    "Secondary capability gap": "Force Protection (FP)",
    "Secondary STO": "STO-1:  Platform Survivability",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "Information Operations (IO)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$899,100",
    "Actual total funding": "$897,445",
    "Last Updated": "04-16-2019"
  },
  {
    "Project ID": 4545,
    "Title": "Machine Learning for Data Fusion to Improve Target Tracking",
    "Topic/tracking number": "",
    "T-Code": "4.5T",
    "TPOC": "Six, William",
    "TPOC Email": "william.e.six@navy.mil",
    "TPOC code": "4.5.5.3",
    "Secondary TPOC": "Rea, Charles",
    "Secondary TPOC Email": "charles.rea@navy.mil",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "PMA231",
    "Interested PMA(s)": "PMA262, PMA265, PMA268, PMA281 (UAS), PMA281 (Weapons), PMA290, PMA298, PMA299 (ASW), PMA299 (Rotary), PMW170",
    "Objective": "Use Artificial Intelligence and Machine learning techniques to optimize data fusion parameters to enhanced the performance of algorithms used to form tracks from sensor measurements given inherently different target behaviors.  Analysis will be used to improve fusion methods and techniques that will be incorporated into platforms for use with the Fleet Tactical Grid network.  Specifically, the improvements will include improved kinematic accuracy, track consistency (duration, reduce redundancy, breaks, and switching), decreasing the probability of missed or incorrect association, and reducing computational requirements to achieve a given kinematic accuracy (compared to particle and grid based filters) for maneuvering targets in multi-INT scenarios (ex. Triton, EP-3E, or F-35).",
    "Description": "The SLAMEM simulation toolset for data fusion and the metrics toolbox will be used to generate data on target behaviors coupled with sensor performance for tracking to determine optimal operating data fusion parameters for various maneuvering target types.   The data generated will be used as a feed to a machine learning algorithm to minimized track to truth data fusion errors while determining the best data fusion parameter values to use for varying targeting behaviors.",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE BAR",
    "Start date": "10-01-2018",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Radar and Antenna Systems Capability",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-4: Computing, Processing, and Architectures",
    "I&I": "Command, Control, and Communications (CCC)",
    "Secondary I&I": "Intelligence (INT)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$345,000",
    "Actual total funding": "$171,900",
    "Last Updated": "07-17-2018"
  },
  {
    "Project ID": 4603,
    "Title": "Growth of Workforce Skill in Implementing Deep Learning Algorithms",
    "Topic/tracking number": "",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Adams, Matthew",
    "TPOC Email": "matthew.p.adams@navy.mil",
    "TPOC code": "4.6.2.2",
    "Secondary TPOC": "Lerma, Nelson",
    "Secondary TPOC Email": "nelson.lerma@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "PMA205, PMA265",
    "Objective": "The objective of the proposed WFD 219 is to develop and expand NAWCAD's cross-competency workforce capabilities through hands-on implementation and exploration of machine learning and deep learning algorithms on the recently acquired High Performance Computer (HPC). The primary algorithm that will be evaluated and used to train on will be the Mask R-CNN algorithm. The Mask R-CNN algorithm was chosen because it represents the current state-of-the-art in convolutional neural networks (CNNs), has readily available quality datasets for training, and has important implementation similarities to algorithms that would be used on Navy datasets, such as Deckplate, NavFlirs, and Aircraft MU.",
    "Description": "It is critical that NAWCAD foster organic knowledge, skill, and ability in the application of Deep Learning algorithms within massively parallel computational platforms to solve Navy enterprise-level data problems.  Three elements are key to achieving this capability: 1) the availability of large datasets, 2) the availability of a large amount of computation power, and 3) personnel with the specialized skills needed to design and implement cutting edge algorithms in a massively parallel computational platform.  Element 1 is being worked on a number of fronts including the AIR-6.8 CBM+ lab where Fleet datasets such as Deckplate, NavFlirs, and Aircraft MU are being made available.  Element 2 is also being addressed by other efforts including the recent acquisition of the high performance computer (HPC) located at NAWCTSD Orlando.  This proposal seeks to help address Element 3 by providing hands-on design and implementation experience (programming, data manipulation, HPC utilization, validation) to current NAWCAD workforce members from AIR-4.0 and 6.0 within the context of a state of the art convolutional neural network application. At least six personnel of various experience levels will participate in this initial hands-on experience.\n\nThe algorithm that has been chosen for the test case is the Mask R-CNN algorithm because it represents the current state-of-the-art in CNNs, has readily available quality datasets for training, and has important implementation similarities to algorithms that would be used on Navy datasets, such as Deckplate, NavFlirs, and Aircraft MU. \n\nThe first step will be to convert the original Mask R-CNN algorithm to run in TensorFlow distributed which is the platform that is implemented on the NAWCTSD HPC. The original Mask R-CNN algorithm was designed to be trained on a single computer with multiple GPUs, this differs from the NAWCTSD HPC which has multiple computers with multiple GPUs. Gaining experience in expanding an algorithm to a distributed massively parallel environment will allow for much greater flexibility in using other algorithms in the future. This step should also result in an immediate boost in training speed compared to the benchmark speed.\n\nThe second step will be to perform a grid search on the hyperparameters of the algorithm. Hyperparameters are all of the “tuning” elements of a particular algorithm, each algorithm has its own set of hyperparameters which have to be tuned for the particular dataset that they are being used on. A grid search simple creates a search space of all the hyperparameters and the tries each set of them and checks to see how well the algorithm performs. For performance reasons the grid search is normally done on a subset of the original dataset and the set of hyperparameters that performs the best is then used on the whole dataset. The bigger you allow the search space to be, the better you can tune the algorithm but also the more time it takes to do the search. The massive amount of computer power provided by the NAWCTSD HPC will allow for a much larger search space than the original author which should allow for greater optimization providing a boost in accuracy. This will provide experience in manipulation of large datasets and coordination of the various components in the HPC.\nThe third step will be to take the knowledge gained in the previous two steps to derive an improvement to the baseline Mask R-CNN algorithm which would provide a boost in training speed, accuracy, or both. The new algorithm will be benchmarked against the baseline Mask R-CNN algorithm in order to quantify the performance gains. This will provide experience in creation and manipulations of algorithms to better fit the current dataset.\n\nUpon completion of the effort, a technical report will be generated laying out the lessons learned from a technical and workforce development context during the course of the project.  This report will help serve as a train the trainer guide and self-study for other employees, and it will be provided to future workforce development curriculum managers to assist in expanding growth in enterprise data science skills.  A CNN utilization guide will also be created documenting how to utilized the Mask R-CNN and similar algorithms within massively parallel computational platforms.  It is also possible that a reviewed publication will be submitted dependent on the overall improvement results of the test case study over existing Mask R-CNN implementations.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Human Systems Design and Decision Support",
    "Core capability identifier": "",
    "Secondary core capability": "Virtual Environments (VE) and Training Technology",
    "Secondary core capability identifier": "",
    "Capability gap": "Naval Warrior Performance (NWP)",
    "STO": "STO-1: Training and Education",
    "Secondary capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "Secondary STO": "STO-1: System Safety and Availability",
    "I&I": "Fleet Support Operations (FSO)",
    "Secondary I&I": "Force Health Protection (FHP)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$221,000",
    "Actual total funding": "$221,000",
    "Last Updated": "08-06-2018"
  },
  {
    "Project ID": 6992,
    "Title": "CYB: Intelligent Host Intrusion Detection and Prevention Agent",
    "Topic/tracking number": "219BAR-19-011",
    "T-Code": "4.8T",
    "TPOC": "Collins, Daniel",
    "TPOC Email": "daniel.r.collins1@navy.mil",
    "TPOC code": "4.8.1.4",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "This basic research project will explore the feasibility of a data-fusion machine-learning-based approach to host intrusion detection. Rather than looking for virus signatures, telltale signs of a specific threat, we aim to develop a system capable of detecting any host compromise, including threats that were unknown at the time the system was designed. Using many performance parameters of a computing system, combined with advanced machine learning techniques, we hope to reliably detect compromised computing systems more quickly and easily than is currently possible.",
    "Description": "FY19: Develop prototype IDS agent\nChoose a list of system metrics to monitor (Cybersecurity Engineer, 0.20 MY)\nChoose and develop a machine learning solution (AI Engineer, 0.30 MY)\nDevelop a test harness for the prototype IDS Agent (Software Engineer, 0.30 MY)\nIntegrate prototype IDS and test harness (0.25 MY)\nLabor: 0.80 MY at GS-12, 0.25 MY at GS-13\nMaterial: $10k for procurement of test environment and development software\n\nFY20: Test agent on common malware\nDetermine feasibility of live vs simulated malware (0.10 MY)\nDevelop malware samples for use in testing (Cybersecurity Engineer, 0.25 MY)\nDevelop test plan explaining test procedures and metrics (0.25 MY)\nPerform initial testing using common/basic malware samples (0.10 MY)\nContinue system development using results of initial test (0.35 MY)\nPerform final test and develop test report (0.15 MY)\nLabor: 0.90 MY at GS-12, 0.30 MY at GS-13\nMaterial: $5k for any additional development software needed\n\nFY21: Test agent on more complex threats\nDevelop more advanced malware samples (stealthy threats, more subtle payloads) (Cybersecurity Engineer, 0.25 MY)\nUpdate test plan with new test points (0.10 MY)\nPerform initial testing using full suite of simulated threats (0.10 MY)\nContinue system development based on test results (0.35 MY)\nPerform final testing (0.10 MY)\nDevelop test report including key system performance metrics (0.20 MY)\nLabor: 0.80 MY at GS-12, 0.30 MY at GS-13\nMaterial: N/A",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.8",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Networks, Information Systems, and Intelligent Agents",
    "Core capability identifier": "",
    "Secondary core capability": "Robotics",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-5: Cyber Defense- Information Assurance (IA) and Network Protection",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-4: Computing, Processing, and Architectures",
    "I&I": "Information Operations (IO)",
    "Secondary I&I": "Command, Control, and Communications (CCC)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$453,200",
    "Actual total funding": "$493,331",
    "Last Updated": "03-28-2019"
  },
  {
    "Project ID": 6952,
    "Title": "PROC ENAB: Universal Hub for Big Data",
    "Topic/tracking number": "219WFD-SG-19-007",
    "T-Code": "4.8T",
    "TPOC": "Jaworowski, Chris",
    "TPOC Email": "christopher.jaworows@navy.mil",
    "TPOC code": 4.8,
    "Secondary TPOC": "Frech, Karen",
    "Secondary TPOC Email": "karen.frech@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The US Navy needs a cross system command Navy Warfare Center unified repository of standardized Navy data to be available for solving problems using machine learning methodology. \n\nFY19 Planned Deliverables:\n•\tKickoff meeting minutes\n•\tKickoff execution plan\n•\tInitial interview form\n•\tPreview of catalog\n•\tProgress reports\n•\tFinal Interview form\n•\tData Catalog prototype\n•\tAssessment report on interview process and catalog use cases",
    "Description": "N/A - Project Lead(s), please provide description.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Networks, Information Systems, and Intelligent Agents",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-4: Computing, Processing, and Architectures",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Information Operations (IO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 7",
    "Estimated total funding": "$261,600",
    "Actual total funding": "$261,580",
    "Last Updated": "04-18-2019"
  },
  {
    "Project ID": 1126,
    "Title": "EF-18 Electronic Combat Automation",
    "Topic/tracking number": "N04-174",
    "T-Code": "4.5T",
    "TPOC": "Garcia, Michael",
    "TPOC Email": "michael.r.garcia@navy.mil",
    "TPOC code": "45P000E",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "Enable advanced EW combat functions required on the EF-18 (Growler) to be performed in an unscripted fashion automatically by one individual rather than the current three individuals on the EA-6B (Prowler).",
    "Description": "Advances in intelligent, adaptive multi-agent systems as well as in processor speed, size, power, and capability now make it practical to massively off-load significant amounts of work associated with electronic combat previously performed by skilled human operators in the EA-6B. This proposal will advance agent teamwork and coordination to strike/support groups of EF-18’s in achieving their missions in a complex physical, tactical, and electromagnetic environment with far less resources available (i.e., fewer ECMOs). The proposal draws from distributed artificial intelligence (DAI) of which intelligent agents are a part. Within DAI, the approach to problem solving is bottom-up as opposed to top down. Bottom-up problem solving involves coordination and communication between agents to address components of the problem, and coordination mechanisms to integrate solutions to address the larger problem. The Belief-Desires-Intention (BDI) framework for teamwork and coordination will be applied to this problem in particular using the theory of joint intentions. This theory addresses mutual goals, joint persistent goals, and joint intentions between multiple cooperating agents to ensure the team achieves its goals. The theory hierarchically build up mutual goals between agents. From this, persistence (i.e., joint persistent goals) is included within mutual goals so that agents keep their goals until they are either satisfied, unachievable or when some other condition occurs. After agents enter into joint persistent goals, they can take actions to achieve those goals. The agents will coordinate through the Control of Agent Based Systems (CoABS) grid (hereafter referred to as the “Grid”). The Grid was developed under the DARPA-CoABS program, and provides one of the most successful and widely used infrastructure to date for the large-scale integration of heterogeneous agent frameworks with object-based applications, and legacy systems. Based on Sun’s JINI services, it includes a method-based application-programming interface to register and advertise capabilities, discover services based on those capabilities, and provides the necessary communication between services. Systems and components on the Grid can be added and upgraded without reconfiguration of the network. Failed or unavailable components are automatically purged from the registry and discovery of similar services and functionality is pursued. *TECHNOLOGY APPROACH imported from Legacy S&T: TBD",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "01-01-2004",
    "End date": "03-31-2010",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-4:  Airborne Electronic Attack",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "",
    "Current TRL": "",
    "Estimated TRL at completion": "",
    "Estimated total funding": "",
    "Actual total funding": "$1,638,601",
    "Last Updated": "12-31-2013"
  },
  {
    "Project ID": 2261,
    "Title": "Master of Science in Electrical Engineering",
    "Topic/tracking number": "219WFD-HE-14-010",
    "T-Code": "4.5T",
    "TPOC": "Rivera, AJ",
    "TPOC Email": "anibal.riveravelazqu@navy.mil",
    "TPOC code": "4.5.14.2",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "PEO(A)-ASW",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Obtain a higher level of expertise in the artificial intelligence and pattern recognition areas.",
    "Description": "After hiring by AIR-4.5.14 (Acoustic Systems Division), I have been trained in the many aspects of airborne acoustic ASW including modeling for mission planning, techniques for in-flight analysis, and methods for post mission reconstruction.  Through my experiences, it has become evident to me that an understanding of advanced signal processing techniques is crucial not only in the planning, modeling, and reconstruction of mission scenarios, but also in the development of airborne ASW systems.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "01-13-2014",
    "End date": "05-31-2015",
    "Project status": "Canceled",
    "Reason for cancellation": "",
    "Core capability": "Airborne Anti-Submarine Warfare (ASW)",
    "Core capability identifier": "",
    "Secondary core capability": "Airborne Anti-Submarine Warfare (ASW)",
    "Secondary core capability identifier": "",
    "Capability gap": "Under Sea Warfare (USW)",
    "STO": "STO-2:  Wide Area Search and Detection",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Anti-Submarine Warfare (ASW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$35,000",
    "Actual total funding": "$32,940",
    "Last Updated": "12-28-2015"
  },
  {
    "Project ID": 7007,
    "Title": "AIRSHIP INT: Robust Adaptive Control for Stabilized UAV Flight Around Moving Ships",
    "Topic/tracking number": "219BAR-19-017",
    "T-Code": "4.3T",
    "TPOC": "DeVon, David",
    "TPOC Email": "david.devon@navy.mil",
    "TPOC code": "AIR4.3.2.6",
    "Secondary TPOC": "Arslanian, Peter",
    "Secondary TPOC Email": "peter.arslanian@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The objective is to develop and apply emerging concepts of robust and adaptive control to improve the flying qualities and overall capabilities of small, light-weight unmanned aerial vehicles (UAVs) with a high degree of flying precision needed for full autonomy and coordinated flight in swarming, remote sensing, and counter UAV operations.  Such advanced concepts for controlling such an air vehicle are required to better compensate for changing dynamic winds that have a great impact on lighter platforms, especially when flying in urban and maritime environments around moving ships.  The primary deliverables will include an advanced control design tailored specifically for operating small multirotor UAVs with changing dynamics and operating within a ship air wake, detailed simulation of the proposed solution, multiple conference publications, and final report that details the results and conclusions found from the research.",
    "Description": "FY19 Execution Plan – The focus is simulation and modeling development with baseline controller design and implementation.  As such, there is no travel expected, and only $5K for hardware needed to complete the simulation effort.  Peter Arslanian and David DeVon are estimated for 10% and 15% of their time for project management and planning, respectively.  Elyard Spencer and Nick Kumia are allocated for 50% and 25% of their time to support the simulation development and control design efforts.  Finally, Scott Reed is allocated for 25% of the year to focus on the adaptive control development and consult on the simulation and other team activities.  The total cost is $157K for FY19.\n\nFY20 Execution Plan – The focus is improving the simulation with more accurate aircraft models and ship air wake disturbance modeling.  The robust adaptive control concept will be fully developed and integrated into the simulation by close of FY20.   The initial algorithm for the advanced control and operating within ship air wake is to be considered for a conference paper.  As such, travel is planned for participating in the conference at a cost of $5K is expected, and $5K of materials funding is included for upgrades needed for the modeling, simulation, and control updates.  Peter Arslanian and David DeVon are estimated for 10% and 50% of their time for project management and adaptive control development, respectively.  Elyard Spencer and Nick Kumia are allocated for 50% and 25% of their time to support the simulation and control design improvements.  Finally, Scott Reed is allocated for 25% of the year to focus on updating the adaptive control development.  The total cost is $222K for FY20.\n\nFY20 Execution Plan – The focus is finalizing the designs and completing a detailed comparison study of the different controllers flying one and possibly multiple UAVs behind a moving ship in simulation.  The results will be drafted into a NAWC technical report and additional conference publication.  If time and funding allows, along with appropriate approvals, small scale flight demonstrations will be identified and completed in coordination with AIR-4.5 and/or AIR-4.8 to fully demonstrate the new capability of the design created.  As such, travel is planned for participating in the conference at a cost of $5K is expected, and $5K of materials funding is included for completing any flight hardware demonstration with inexpensive, small-scale equipment (that is safe and highly unlikely to damage any external equipment).  Peter Arslanian and David DeVon are estimated for 10% and 50% of their time for project management and analysis, respectively.  Elyard Spencer and Nick Kumia are allocated for 50% and 25% of their time to support the simulation and test case development.  Finally, Scott Reed is allocated for 25% of the year to focus on analysis.  The total cost is $225K for FY20.\n\nNote - Support of the provided names has been discussed and pre-planned with their supervisors.  The AIR-4.3.2.6 research team as approved use and access privileges with AIR-4.5 regarding the UAV Flying Lab.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE BAR",
    "Start date": "10-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-6: Aircraft/Ship Integration",
    "Secondary capability gap": "Enterprise and Platform Enablers (EPE)",
    "Secondary STO": "STO-3: Vertical Lift Platform Enablers",
    "I&I": "Expeditionary Warfare (EXW)",
    "Secondary I&I": "Naval Special Warfare (NSW)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$682,200",
    "Actual total funding": "$682,850",
    "Last Updated": "04-01-2019"
  },
  {
    "Project ID": 6941,
    "Title": "ADV TECH: Synthetic Aperture Radar Phase History Data Processing Lab",
    "Topic/tracking number": "219WFD-SG-19-006",
    "T-Code": "4.5T",
    "TPOC": "Statter, Don",
    "TPOC Email": "donald.statter@navy.mil",
    "TPOC code": "4.5.5.3",
    "Secondary TPOC": "Payne, Benjamin",
    "Secondary TPOC Email": "benjamin.payne@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "Develop National leadership capability to perform Synthetic Aperture Radar (SAR) Image Formation Processing (IFP) products from raw Phase History Data (PHD). This dedicated SAR PHD laboratory shall establish leadership within the US Navy, DoD, and the National Intelligence Community (NIC) in reference to aircraft based collection, and processing of SAR IFP and related systems development and test. Increase capabilities to provide organic SAR development and support for systems performing anti-surface, anti-submarine, and intelligence and reconnaissance missions.",
    "Description": "Year 1: Lab Set-Up; Training; establish CRADA with KeyW; Real-Time SAR IFP to include basic NAASW Processing to include time-domain and phase error correction processing for moving target focus.   \nYear 2: 3-D Terrain Models, large area SAR mosaics with EO/V/IR sensor data fusion. \nYear 3: Artificial Intelligence (AI) enhanced processes; Transitions to operational air platforms.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Airborne Anti-Submarine Warfare (ASW)",
    "Core capability identifier": "",
    "Secondary core capability": "Sensor and Data Fusion",
    "Secondary core capability identifier": "",
    "Capability gap": "Under Sea Warfare (USW)",
    "STO": "STO-3:  Precision Localization/Identification/Attack",
    "Secondary capability gap": "Force Protection (FP)",
    "Secondary STO": "STO-1:  Platform Survivability",
    "I&I": "Anti-Submarine Warfare (ASW)",
    "Secondary I&I": "Intelligence (INT)",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "Y",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 7",
    "Estimated total funding": "$1,577,700",
    "Actual total funding": "$1,317,538",
    "Last Updated": "03-29-2019"
  },
  {
    "Project ID": 4547,
    "Title": "Persons Under Reconnaissance and Surveillance Utilizing Intelligent Technologies",
    "Topic/tracking number": "",
    "T-Code": "4.5T",
    "TPOC": "Rea, Charles",
    "TPOC Email": "charles.rea@navy.mil",
    "TPOC code": "4.5.5.3",
    "Secondary TPOC": "Sweeney, Greg",
    "Secondary TPOC Email": "gregory.r.sweeney@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "PMA263",
    "Interested PMA(s)": "",
    "Objective": "Persons Under Reconnaissance  and Surveillance Utilizing Intelligent Technologies (PURSUIT) seeks to implement cutting edge  Artificial Intelligence (AI) techniques onboard Unmanned Aerial Vehicles (UAVs).  These demonstrated techniques will utilize deep learning to support human/object detection and identification, and gesture recognition/control, which will result in autonomous behaviors critical to mission success. Unlike any previous efforts, this project will demonstrate multiple capabilities being brought together in real-time operations in more complex environments than have been previously demonstrated.",
    "Description": "Hypothesis:  Combining various deep learning sensor processing techniques into an airborne autonomy architecture will allow critical portions of Navy missions to be conducted with decreased risk to the warfighter.  By employing low cost unmanned vehicles with commercially available sensors into hostile areas, valuable intelligence can be gathered which requires minimal human interaction.\n   Methodology:\nResearch Topics\nRequirement Analysis: Initiate an analysis that will lead to a concise assessment of the efforts being made by government, industry, academia to distinguish our efforts from currently available products, and to identify operational needs.\nSystem Design: Leveraging related autonomy projects in addition to further developing and integrating the required sensor processing and autonomous behaviors.\nComponent Integration: Integration of the various hardware and software components will be necessary to test and demonstrate the overall capability.\nTesting: System level metrics will track progress against the initially determined performance specifications.  All testing will be performed an in iterative and agile manner.\nDemonstration",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Overhead",
    "Start date": "10-01-2018",
    "End date": "09-30-2020",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "EO Imaging Systems",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-6: Intelligence, Surveillance, Reconnaissance and Targeting",
    "Secondary capability gap": "Information Dominance (ID)",
    "Secondary STO": "STO-1: Command and Control",
    "I&I": "Expeditionary Warfare (EXW)",
    "Secondary I&I": "Irregular Warfare (IW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$496,000",
    "Actual total funding": "$271,420",
    "Last Updated": "06-22-2018"
  },
  {
    "Project ID": 4853,
    "Title": "Blending Classical Model-Based Target Classification and Identification Approaches with Data-Driven Artificial Intelligence",
    "Topic/tracking number": "N18B-T033",
    "T-Code": "4.5T",
    "TPOC": "Allen, Oliver",
    "TPOC Email": "oliver.allen@navy.mil",
    "TPOC code": 4.5,
    "Secondary TPOC": "Skaggs, Lee",
    "Secondary TPOC Email": "herman.skaggs@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "PMA262",
    "Interested PMA(s)": "PMA262",
    "Objective": "Develop innovative techniques that combine the robustness and explainability of model-based target identification and classification approaches with the potential to optimally establish feature vector coefficients using data-driven, deep-learning artificial-intelligence approaches.",
    "Description": "The most robust state-of-the-art target classification and identification approaches rely on expert knowledge and model driven principles to mimic the methods used by expert human operators in manual target classification and identification. These approaches rely on the identification of a set of target features that allow one target to be confidently separated from other, different targets. This STTR topic seeks to evolve from classification ranking systems based on a distance metric with pre-assigned feature weights to a more optimal classifier in which the selection of features and their weights are determined automatically from a statistical analysis of the collected feature vectors data for each sensor. Such an approach provides the rationale for feature selection and weighting as it is based on measured feature variance vector for each sensor. Furthermore, the statistical analysis of collected feature vectors enables the calculation of accurate matching confidence within the classifier. This provides the needed explainability to quantify to what extent the operator should trust the classification results. The efficacy of the approach should improve with the accumulation of operational data. Sensor systems to be considered are imaging radar, electro-optics, imaging infrared, and electronic support measures. Applications include maritime vessel and overland vehicle classification and identification.",
    "Primary transition type": "K - Transition details pending",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "STTR",
    "Start date": "10-15-2018",
    "End date": "04-25-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "Radar and Antenna Systems Capability",
    "Secondary core capability identifier": "",
    "Capability gap": "Surface Warfare (SUW)",
    "STO": "STO-1:  Maritime Surveillance and Interdiction",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Anti Surface Warfare (ASuW)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 3",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "$249,999",
    "Last Updated": "03-11-2019"
  },
  {
    "Project ID": 1273,
    "Title": "Creation of Realistic Simulated Human Characters within CryEngine3",
    "Topic/tracking number": "219WFD-SG-13-009",
    "T-Code": "4.6T (TSD)",
    "TPOC": "Mcnamara, Courtney",
    "TPOC Email": "courtney.mcnamara@navy.mil",
    "TPOC code": "4.6.2.2",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "AIR-1.0",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The expected expertise to be gained will be the knowledge of how to effectively render highly immersive and effective training content, as well as, human realistic virtual characters within a current state-of-the-art game engine.  The expected branch doma",
    "Description": "This effort targets the need to obtain first hand user experience and evaluation of the capabilities to create realistic, computer generated characters using a state of the art game development engine, CryEngine3. *TECHNOLOGY APPROACH imported from Legacy S&T: Select a previously authored scenario from an existing simulation-based trainer.  Experimentally determine the best implementation methods for human realistic behaviors within CryEngine3  Subjectively compare the finished results of the proof of concept s",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "11-01-2012",
    "End date": "08-29-2013",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Naval Warrior Performance (NWP)",
    "STO": "STO-1: Training and Education",
    "Secondary capability gap": "Naval Warrior Performance (NWP)",
    "Secondary STO": "STO-2: Human Systems Design and Decision Support",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 4",
    "Current TRL": "TRL 5",
    "Estimated TRL at completion": "TRL 5",
    "Estimated total funding": "$32,200",
    "Actual total funding": "$32,190",
    "Last Updated": "09-23-2015"
  },
  {
    "Project ID": 4863,
    "Title": "Real-Time Validation of Machine Intelligence Controlling Unmanned Vehicle Autonomous Operations",
    "Topic/tracking number": "N18B-T032",
    "T-Code": "4.5T",
    "TPOC": "Ramsay, BJ",
    "TPOC Email": "bryan.ramsay@navy.mil",
    "TPOC code": "PMA281",
    "Secondary TPOC": "Nagy, Bruce",
    "Secondary TPOC Email": "bruce.nagy@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "PMA281 (UAS)",
    "Interested PMA(s)": "PMA262, PMA263, PMA268",
    "Objective": "Develop a machine intelligence system that provides real-time validation and trust in decisions made by unmanned vehicles implementing machine intelligence to control autonomous vehicles",
    "Description": "If an operator was to control multiple autonomous vehicles operating in potentially different domains and executing mission goals from onboard machine intelligent systems, it is important that the operator be provided support in terms of validation that the unmanned vehicle machine intelligence is making the correct decisions regarding their autonomously generated mission parameters. As operators delegate more control to autonomous systems, the risk increases that the system might make an inappropriate decision, before that decision and resulting action is detected by the operator.  Therefore, a high fidelity decision aid is required to provide oversight to the operator that a complex system of multiple vehicles is operating correctly, safely and within existing rules.  The operators must be assured that autonomously operating vehicles would adhere to applicable legal (e.g. rules of Law of Armed Conflicts) and ethical principles [Ref 8] in the decision processes that are being made by autonomous vehicles. Because of the many, perhaps swarms of, autonomous vehicles that the operator must track, an intelligent process is necessary. This process must be able to observe ongoing autonomous operations and assure that decisions made are appropriate for the situation. The primary goal is not just to provide real-time validation of the ongoing autonomous operation but through machine learning techniques, establish and develop trust in the autonomously operating vehicle's decision making process. The tool should alert the operator if the autonomous vehicle is taking inappropriate action, for example as an extremely rare case, readying itself to launch a weapon without operator concurrence/approval. The tool must validate and verify system performance while providing accurate and timely feedback, and ultimately increase operator trust in the autonomously operating systems behavior.",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA281 (UAS)",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "STTR",
    "Start date": "10-17-2018",
    "End date": "04-25-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-3: Collaborative Unmanned Strike Capability",
    "Secondary capability gap": "Under Sea Warfare (USW)",
    "Secondary STO": "STO-3:  Precision Localization/Identification/Attack",
    "I&I": "Strike Warfare (STW)",
    "Secondary I&I": "Anti Surface Warfare (ASuW)",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 2",
    "Current TRL": "TRL 2",
    "Estimated TRL at completion": "TRL 4",
    "Estimated total funding": "$0",
    "Actual total funding": "$374,714",
    "Last Updated": "03-11-2019"
  },
  {
    "Project ID": 4817,
    "Title": "Network Science Approach to Assess Complex System Robustness",
    "Topic/tracking number": "ILIR-19-001",
    "T-Code": "4.3T",
    "TPOC": "Talukder, Famim",
    "TPOC Email": "famim.talukder@navy.mil",
    "TPOC code": "4.3.2.2",
    "Secondary TPOC": "Rea, Charles",
    "Secondary TPOC Email": "charles.rea@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "None or N/A",
    "Interested PMA(s)": "",
    "Objective": "The objective of the proposed effort is to utilize machine learning and artificial intelligence techniques to develop optimized and efficient algorithms to apply network science and graph theory in military settings. The primary deliverables will be the development of new techniques and algorithms to determine the strengths and weaknesses of modern military systems.  The proposed effort is in support of a Ph.D. in Computer Science Engineering from the University of Notre Dame and will result is a dissertation satisfying the degree requirements.",
    "Description": "Mr. Rea, a subject matter expert in machine learning and an employee of NAVAIR 4.5.5.3, will be the secondary investigator on this project, providing consulting as required at no cost to the proposed effort.  It is therefore a cross competency effort.\n\nFiscal Year 2019: Labor $21.69k; Travel $2k; Materials $5k\n\nA synthetic network representative of the modern military network will be created, resulting from effort in Phase I. This model will be the basis of future research efforts and algorithm development. To develop such a synthetic network, work has already commenced on studying different types of networks. Phase II will begin once a valid synthetic network has been developed. Phase II will continue through FY20 and will work towards the identification of critical agents in the synthetic networks. \n\nBy the end of FY19, several methods will have been developed to create synthetic military networks representative of real world military networks. This will be the base of future research and methods developed in this endeavor. Famim Talukder will complete the all of the tasking in this fiscal year with SME support from Charles Rea.\n\nTravel costs of $2k to present FY19 results at a conference.\n-----------------------------------------------------------------------------\nFiscal Year 2020: Labor $54.44k; Travel $5k; Materials $5k\n\nWork will continue on Phase II, completed during the first half of FY20. Phase III will identify critical agents in a partially known network. Algorithms developed in Phase II will be revisited and possibly changed to compensate for the added obstacle. The primary goal of FY20 will be able to determine critical agents in a fully known static network. A secondary goal will be to determine valuable agents, if not critical agents, in the synthetic network. Algorithms will also be incrementally tested and optimized during FY20 to make it more useable in real networks.\n\nThe first six months will be spent on Phase II efforts. Phase III efforts will likely take the remaining time of FY20. The goal of FY20 will be able to produce effective and efficient algorithms at determining critical agents in fully known static networks. Ideally, critical agents of partially known networks will be determined by the end of FY20. Famim Talukder will complete all of the tasking during FY20 with SME support from Charles Rea.\n\nTravel costs of $5k to present FY20 results at a conference, and traveling to Notre Dame to meet with the Ph.D. advisor.\n------------------------------------------------------------------------------------------------\nFiscal Year 2021: Labor $54.71k; Travel $5k; Materials $5k\n\nFY21 will be spent on determining how the static networks created in Phase I can be modified to represent dynamic networks. This should only take two months. Remaining FY21 time will be spent working to determine critical agents in the fully known dynamic network, as stated in Phase IV. During the end of FY21, Phase V will begin to determine critical agents in a partially known dynamic network. The goals of Phase IV are to model the military network as a dynamic network and to develop algorithms to efficiently determine critical agents in the new network. An iterative testing plan will be executed to ensure that developed methods are producing expected results in a timely manner.\n\nPhase IV will commence at the start of the FY21. Work on Phase V will also start in the latter part of FY21, at which point both phases will be executed concurrently. Progress in one phase will have a direct impact on the other.  Famim Talukder will complete all of the tasking during FY21 with SME support from Charles Rea.\n\nTravel costs of $5k to present FY21 results at a conference, and traveling to Notre Dame to meet with Ph.D. advisor.\n------------------------------------------------------------------------------------------------\nFiscal Year 2022: Labor $42.68k; Travel $3k; Materials $5k\n\nDuring FY22, work will continue on understanding and developing algorithms for dynamic networks, specifically partially known dynamic networks. The primary goal of FY22 is to develop algorithms that are accurate and efficient in determining critical agents in a partially known dynamic network. Developed algorithms will be tested in different modern military networks to understand effectiveness.\n\nAt the end of FY22, numerous algorithms and techniques will have been developed as a result of this research effort, which are the deliverables of this effort. Famim Talukder will complete all of the tasking during FY22 with the support of Charles Rea. \n\nTravel costs of $3k will be utilized to present FY22 results at a conference.\n\nThe deliverable for the effort will be a completed Ph.D. dissertation to satisfy the degree requirements.",
    "Primary transition type": "I - Basic research exempt",
    "Primary transition manager": "",
    "Funds provided by": "Navy",
    "Funding source": "NAWC AD In-House Laboratory Independent Research (ILIR)",
    "Start date": "01-01-2019",
    "End date": "12-31-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Transformational Aeromechanics Technology",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Intelligence (INT)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 1",
    "Current TRL": "TRL 1",
    "Estimated TRL at completion": "TRL 3",
    "Estimated total funding": "$346,300",
    "Actual total funding": "$260,679",
    "Last Updated": "12-17-2018"
  },
  {
    "Project ID": 1696,
    "Title": "Automated Maximum Density Analysis Tool for Spot Factor Generation",
    "Topic/tracking number": "N08-125",
    "T-Code": "4.8T",
    "TPOC": "Meiswinkle, Justin",
    "TPOC Email": "justin.meiswinkle@navy.mil",
    "TPOC code": 4.8,
    "Secondary TPOC": "Schalnat, Christopher",
    "Secondary TPOC Email": "christopher.schalnat@navy.mil",
    "Portfolio": "PEO(T)",
    "Primary supporting PMA": "PMA251",
    "Interested PMA(s)": "",
    "Objective": "Develop a tool to automatically generate an aircraft’s spot factor, saving a significant amount of workload over the present manual methods.",
    "Description": "The Maximum Density Spot Factor, or “spot factor”, is a metric that determines the handling and spotting characteristics of aircraft on carrier flight or hangar decks.  It is used as the contractual means to limit the size of new, developmental aircraft.  The setting of objective and threshold spot factor requirements is an important aspect of aircraft weapon system contract document preparation, and the review of emerging design concepts against these requirements is a key step in assuring the delivery of ship-compatible aircraft to the fleet.    The Navy is seeking a tool that could automatically calculate the spot factor given the aircraft and deck dimensions.  This tool will have to perform at least as well as a human subject matter expert, i.e. fit the maximum number of aircraft into safe parking areas. *TECHNOLOGY APPROACH imported from Legacy S&T: Various artificial intelligence algorithms (such as A*) for finding the maximum amount of aircraft that can pack into a constrained space.",
    "Primary transition type": "G - Product transitions to Naval Air Warfare Center / Fleet Readiness Center",
    "Primary transition manager": "AIR-4.8",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "09-01-2008",
    "End date": "09-30-2012",
    "Project status": "Transitioned",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-6: Aircraft/Ship Integration",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "TRL 3",
    "Current TRL": "TRL 8",
    "Estimated TRL at completion": "TRL 8",
    "Estimated total funding": "$0",
    "Actual total funding": "$975,917",
    "Last Updated": "11-04-2015"
  },
  {
    "Project ID": 1703,
    "Title": "Dynamic Physical/Data-Driven Models for System-Level Prognostics and Health Management",
    "Topic/tracking number": "N10A-T009",
    "T-Code": "4.8T",
    "TPOC": "Malesich, Michael",
    "TPOC Email": "michael.malesich@navy.mil",
    "TPOC code": "4.8.6.12",
    "Secondary TPOC": "Fernandi, Jennifer",
    "Secondary TPOC Email": "jennifer.fernandi@navy.mil",
    "Portfolio": "AIR-1.0",
    "Primary supporting PMA": "PMA260",
    "Interested PMA(s)": "",
    "Objective": "Develop a set of tools that will enable integration of distributed, heterogeneous data and models for system-level prognostics and health management.",
    "Description": "The field of prognostics and health management (PHM) has made significant advances in the ability to monitor and predict degradation and failure in structural and mechanical components. Unfortunately, similar advances have not been made with electronic components, especially in avionics. To date, results in electronic prognostics have been limited to small cases involving analog components and modules (e.g., power supplies) and material degradation of electronic components (e.g., delamination in integrated circuits). The computational complexity of existing PHM techniques makes it virtually impossible to apply them from a system-level perspective (e.g., monitoring across multiple avionic systems such as radar, GPS, and communications systems). Due to the rapidly emerging state of electronics-PHM and the desire to enhance existing test maintenance systems, the data modeling and ontology aspects of this field must be addressed. New methodologies and tools for PHM are sought to draw on multiple techniques in state estimation, fault and failure modeling, and prediction. Proposed methods must be capable of analyzing large amounts of data from distributed, heterogeneous sources.     At this stage, it is expected that the proposed e-PHM tools would be applied in an offline environment, utilizing information collected from data sources such as built-in test, automatic test systems (ATS), and other monitoring technologies. To minimize expense of system integration, such tools should focus on existing onboard monitoring systems and be integrated tightly with off-board ATS. The goal is to provide new analysis capabilities, consistent with the Navy’s Conditioned Based Maintenance (CBM+) initiatives, with minimal impact on existing systems under test. Recent results in incipient fault detection and gray-scale health assessment, identification of requirements for CBM+, and interface standardization through the IEEE, potentially offer a foundation in developing system-level health-assessment prediction tools and supporting data management and analysis. In terms of interface standardization, the proposed tools should incorporate standards such as IEEE 1232 Artificial Intelligence Exchange and Service Tie to All Test Environments (AI-ESTATE), IEEE 1636 Software Interface for Maintenance Information Collection and Analysis (SIMICA), and IEEE 1671 Automatic Test Markup Language (ATML)), system monitoring (e.g., ISO 133374), and CBM technologies (e.g., Machinery Information Management Open Systems Alliance (MIMOSA) OSA-CBM, ISO 10303-239 PLCS, and Organization for the Advancement of Information Standards (OASIS) PLCS DEX).      *TECHNOLOGY APPROACH imported from Legacy S&T: PHASE III: Refine and deliver algorithms and tool for system-level PHM, suitable for use in a maintenance shop. Transition the technology to various defense platforms.     PRIVATE SECTOR COMMERCIAL POTENTIAL/DUAL-USE APPLICATIONS: Industries involved in l",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA260",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "STTR",
    "Start date": "07-30-2010",
    "End date": "05-31-2014",
    "Project status": "Transitioned",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$979,900",
    "Actual total funding": "$979,907",
    "Last Updated": "07-20-2018"
  },
  {
    "Project ID": 1685,
    "Title": "Intelligent Embedded Diagnostic System for Future Avionic Systems",
    "Topic/tracking number": "N02-167",
    "T-Code": "4.8T",
    "TPOC": "Malesich, Michael",
    "TPOC Email": "michael.malesich@navy.mil",
    "TPOC code": "4.8.6.12",
    "Secondary TPOC": "Malesich, Michael",
    "Secondary TPOC Email": "michael.malesich@navy.mil",
    "Portfolio": "AIR-1.0",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "tbd",
    "Description": "This effort is developing improved embedded diagnostics for avionics as well as open communications architectures that enable information continuity between on-board and off-board systems. Within this paradigm shift approach, embedded diagnostics improvements are being pursued through the evaluation of improved sensed features, artificial intelligence methods, and more detailed consideration of available situational data from bus monitors and environmental sensors. In addition, an ambiguity group analysis that employs data fusion is being developed to assist the at-wing, automated test equipment, to rank probable causes. The information continuity through the maintenance and logistics systems is best enabled with a suitable open architecture protocol, such as those based upon CORBA or XML implementations of OSA-CBM. The approach allows the diagnostics results, symptoms evaluated, and operational/environmental conditions to be more easily captured in a database that allows for further data mining, clustering, case-based reasoning, and other knowledge discovery methods. The proposed work addresses the development of embedded diagnostic/prognostic avionics health management technologies that will provide dramatic improvement to the current state of avionics diagnostics and repair. This will, in turn, improve overall mission readiness by decreasing the downtime for repair and total number of repair instances. *TECHNOLOGY APPROACH imported from Legacy S&T: tbd",
    "Primary transition type": "A - Naval Aviation Program Of Record takes delivery and funds additional development/deployment",
    "Primary transition manager": "PMA260",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "SBIR",
    "Start date": "01-01-2002",
    "End date": "08-25-2008",
    "Project status": "Transitioned",
    "Reason for cancellation": "",
    "Core capability": "Diagnostics of Avionics",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-2: Total Ownership Cost",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "Y",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "",
    "Current TRL": "TRL 7",
    "Estimated TRL at completion": "TRL 7",
    "Estimated total funding": "$1,700,000",
    "Actual total funding": "$1,681,349",
    "Last Updated": "09-25-2014"
  },
  {
    "Project ID": 4744,
    "Title": "LabVIEW Core 1 and 2 Training, and Two LabVIEW Professional Licenses",
    "Topic/tracking number": "219WFD-TR-19-031",
    "T-Code": "4.8T",
    "TPOC": "Zabriskie, Sean",
    "TPOC Email": "sean.zabriskie@navy.mil",
    "TPOC code": "4.8.1.4",
    "Secondary TPOC": "Lehaf, George",
    "Secondary TPOC Email": "george.lehaf@navy.mil",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "The objective is to provide NI LabVIEW training to approximately ten (10) attendees in Lakehurst, NJ in order to: develop the workforce, enhance the team’s skillset and improve capability. Additionally, the goal is to secure two (2) LabVIEW licenses so that team members can use the lessons learned during the training to develop science and technology products.",
    "Description": "",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2018",
    "End date": "09-30-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Controls, Sensors, and Instrumentation, and PHM for Mechanical Systems",
    "Core capability identifier": "",
    "Secondary core capability": "Robotics",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "N/A",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$32,000",
    "Actual total funding": "$31,455",
    "Last Updated": "09-27-2018"
  },
  {
    "Project ID": 4534,
    "Title": "Rotation to Naval Research Laboratory (NRL) - Ari Goodman",
    "Topic/tracking number": "219WFD-ROT-19-001",
    "T-Code": "4.8T",
    "TPOC": "Goodman, Ari",
    "TPOC Email": "ari.b.goodman@navy.mil",
    "TPOC code": "4.8.1.4",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "Gain robotics and artificial intelligence expertise currently unavailable at NAVAIR through a Naval Research Laboratory (NRL) rotation. Experience will be gained through exposure to hands-on assignments and interaction with experts in their respective fields at NRL.",
    "Description": "This rotation will be full time and Mr. Goodman will be supporting NRL. Duration of the rotation will consist of half a man year carried out throughout the remainder of fiscal year 2019 upon initial start date, expected to be January 15, 2019. \nNAWCAD will be responsible for covering labor. NRL will be responsible for covering Mr. Goodman’s travel costs.\nNRL will provide Mr. Goodman working space, computer and phone access, and the related tools to complete assigned tasks. NRL will be responsible for providing technical instruction related to the assigned tasks.",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "01-15-2019",
    "End date": "07-15-2019",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Robotics",
    "Core capability identifier": "",
    "Secondary core capability": "Networks, Information Systems, and Intelligent Agents",
    "Secondary core capability identifier": "",
    "Capability gap": "System Safety, Availability and Affordability Enablers (SSAA)",
    "STO": "STO-1: System Safety and Availability",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Information Operations (IO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$48,650",
    "Actual total funding": "$48,650",
    "Last Updated": "06-21-2018"
  },
  {
    "Project ID": 6944,
    "Title": "Higher Education Application (MS in Machine Learning/CS from Georgia Tech)",
    "Topic/tracking number": "",
    "T-Code": "4.5T",
    "TPOC": "Sakano, Kristy",
    "TPOC Email": "kristy.sakano@navy.mil",
    "TPOC code": "4.5.5.3",
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "The objective is to obtain a Master's degree in Machine Learning from Georgia Institute of Technology's Computer Science Department.",
    "Description": "As a recent college graduate, I believe my background as a computational physicist is unique and contributive to the field of data analytics. I am looking for an opportunity to further my educational career and gain academic knowledge, which will help me pivot myself into a critical position in the Navy to work on swarm intelligence, AI, and autonomy. \n\nIn particular, I have selected to apply for a Master of Science in Computer Science, Specialization in Machine Learning as the classwork aligns with my interests and career goals. Furthermore, all prerequesite classes and requirements have already been fulfilled in advance of my application.",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC WD Section 219 NISE WFD",
    "Start date": "01-06-2020",
    "End date": "05-27-2022",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "Sensor and Data Fusion",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Information Dominance (ID)",
    "STO": "STO-4: Computing, Processing, and Architectures",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "Non-Combat Operations (NCO)",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$9,700",
    "Actual total funding": "",
    "Last Updated": "02-19-2019"
  },
  {
    "Project ID": 4821,
    "Title": "Doctor of Computer Science - Big Data Analytics",
    "Topic/tracking number": "219WFD-HE-19-006",
    "T-Code": "5.3T",
    "TPOC": "Balcom, Donald",
    "TPOC Email": "donald.balcom@navy.mil",
    "TPOC code": 5.3,
    "Secondary TPOC": "",
    "Secondary TPOC Email": "",
    "Portfolio": "NAWC",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "The DCS-BDA program is designed to aid leaders, data analysts, and data scientists in the development and use of tools and techniques to analyze large amounts of distributed, unstructured data in order to produce meaningful insight and automation for NAWCAD.\n- Assess and apply the use of big data software tools to organize various types of datasets\n- Evaluate artificial intelligence solutions to big data problems\n- Devise algorithms for efficiently processing big data to support business operations\n- Create a big data use-and-analysis framework for the mission of NAWCAD",
    "Description": "",
    "Primary transition type": "J - No transition planned",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "11-13-2018",
    "End date": "12-31-2021",
    "Project status": "Active",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Enterprise and Platform Enablers (EPE)",
    "STO": "STO-1: Enterprise Enablers",
    "Secondary capability gap": "",
    "Secondary STO": "",
    "I&I": "N/A",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "N/A",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$74,000",
    "Actual total funding": "$74,004",
    "Last Updated": "11-19-2018"
  },
  {
    "Project ID": 1947,
    "Title": "Artificial Intelligence and Autonomy Training",
    "Topic/tracking number": "219WFD-TR-12-019",
    "T-Code": "5.4T",
    "TPOC": "Kang, Mark",
    "TPOC Email": "sinkyu.kang@navy.mil",
    "TPOC code": 4.9,
    "Secondary TPOC": "Riddle, Stephanie",
    "Secondary TPOC Email": "stephanie.riddle@navy.mil",
    "Portfolio": "PEO(U&W)-UAS",
    "Primary supporting PMA": "",
    "Interested PMA(s)": "",
    "Objective": "Workforce training",
    "Description": "Introduce broad background on unmanned systems. Provide knowledge and information to DoD work force about functionality and definitions of autonomous capabilities in unmanned systems. *TECHNOLOGY APPROACH imported from Legacy S&T: Different algorithms to create autonomous behaviors",
    "Primary transition type": "",
    "Primary transition manager": "",
    "Funds provided by": "Internal NAVAIR/NAWC",
    "Funding source": "NAWC AD Section 219 NISE WFD",
    "Start date": "10-01-2011",
    "End date": "09-30-2013",
    "Project status": "Completed",
    "Reason for cancellation": "",
    "Core capability": "",
    "Core capability identifier": "",
    "Secondary core capability": "",
    "Secondary core capability identifier": "",
    "Capability gap": "Strike Operations (STK)",
    "STO": "STO-3: Collaborative Unmanned Strike Capability",
    "Secondary capability gap": "Enterprise and Platform Enablers (EPE)",
    "Secondary STO": "STO-1: Enterprise Enablers",
    "I&I": "",
    "Secondary I&I": "",
    "NAWC lab": "AD",
    "RTOC?": "N",
    "I-readiness?": "N",
    "Demonstration/experimentation candidate?": "N",
    "Starting TRL": "",
    "Current TRL": "N/A",
    "Estimated TRL at completion": "N/A",
    "Estimated total funding": "$198,000",
    "Actual total funding": "$201,696",
    "Last Updated": "10-06-2014"
  }
]